RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/sdh_reg.h
/**
  ******************************************************************************
  * @file    sdh_reg.h
  * @version V1.2
  * @date    2018-10-08
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2018 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __SDH_REG_H__
#define __SDH_REG_H__

#include "bl808.h"

/* 0x00 : System Address Low Register */
#define SDH_SD_SYS_ADDR_LOW_OFFSET (0x00)
#define SDH_DMA_ADDR_L             SDH_DMA_ADDR_L
#define SDH_DMA_ADDR_L_POS         (0U)
#define SDH_DMA_ADDR_L_LEN         (16U)
#define SDH_DMA_ADDR_L_MSK         (((1U << SDH_DMA_ADDR_L_LEN) - 1) << SDH_DMA_ADDR_L_POS)
#define SDH_DMA_ADDR_L_UMSK        (~(((1U << SDH_DMA_ADDR_L_LEN) - 1) << SDH_DMA_ADDR_L_POS))

/* 0x02 : System Address High Register */
#define SDH_SD_SYS_ADDR_HIGH_OFFSET (0x02)
#define SDH_DMA_ADDR_H              SDH_DMA_ADDR_H
#define SDH_DMA_ADDR_H_POS          (0U)
#define SDH_DMA_ADDR_H_LEN          (16U)
#define SDH_DMA_ADDR_H_MSK          (((1U << SDH_DMA_ADDR_H_LEN) - 1) << SDH_DMA_ADDR_H_POS)
#define SDH_DMA_ADDR_H_UMSK         (~(((1U << SDH_DMA_ADDR_H_LEN) - 1) << SDH_DMA_ADDR_H_POS))

/* 0x04 : Block Size Register */
#define SDH_SD_BLOCK_SIZE_OFFSET (0x04)
#define SDH_BLOCK_SIZE           SDH_BLOCK_SIZE
#define SDH_BLOCK_SIZE_POS       (0U)
#define SDH_BLOCK_SIZE_LEN       (12U)
#define SDH_BLOCK_SIZE_MSK       (((1U << SDH_BLOCK_SIZE_LEN) - 1) << SDH_BLOCK_SIZE_POS)
#define SDH_BLOCK_SIZE_UMSK      (~(((1U << SDH_BLOCK_SIZE_LEN) - 1) << SDH_BLOCK_SIZE_POS))
#define SDH_HOST_DMA_BDRY        SDH_HOST_DMA_BDRY
#define SDH_HOST_DMA_BDRY_POS    (12U)
#define SDH_HOST_DMA_BDRY_LEN    (3U)
#define SDH_HOST_DMA_BDRY_MSK    (((1U << SDH_HOST_DMA_BDRY_LEN) - 1) << SDH_HOST_DMA_BDRY_POS)
#define SDH_HOST_DMA_BDRY_UMSK   (~(((1U << SDH_HOST_DMA_BDRY_LEN) - 1) << SDH_HOST_DMA_BDRY_POS))

/* 0x06 : Block Count Register */
#define SDH_SD_BLOCK_COUNT_OFFSET (0x06)
#define SDH_BLOCK_COUNT           SDH_BLOCK_COUNT
#define SDH_BLOCK_COUNT_POS       (0U)
#define SDH_BLOCK_COUNT_LEN       (16U)
#define SDH_BLOCK_COUNT_MSK       (((1U << SDH_BLOCK_COUNT_LEN) - 1) << SDH_BLOCK_COUNT_POS)
#define SDH_BLOCK_COUNT_UMSK      (~(((1U << SDH_BLOCK_COUNT_LEN) - 1) << SDH_BLOCK_COUNT_POS))

/* 0x08 : Argument Low Register */
#define SDH_SD_ARG_LOW_OFFSET (0x08)
#define SDH_ARG_L             SDH_ARG_L
#define SDH_ARG_L_POS         (0U)
#define SDH_ARG_L_LEN         (16U)
#define SDH_ARG_L_MSK         (((1U << SDH_ARG_L_LEN) - 1) << SDH_ARG_L_POS)
#define SDH_ARG_L_UMSK        (~(((1U << SDH_ARG_L_LEN) - 1) << SDH_ARG_L_POS))

/* 0x0A : Argument High Register */
#define SDH_SD_ARG_HIGH_OFFSET (0x0A)
#define SDH_ARG_H              SDH_ARG_H
#define SDH_ARG_H_POS          (0U)
#define SDH_ARG_H_LEN          (16U)
#define SDH_ARG_H_MSK          (((1U << SDH_ARG_H_LEN) - 1) << SDH_ARG_H_POS)
#define SDH_ARG_H_UMSK         (~(((1U << SDH_ARG_H_LEN) - 1) << SDH_ARG_H_POS))

/* 0x0C : Transfer Mode Register */
#define SDH_SD_TRANSFER_MODE_OFFSET (0x0C)
#define SDH_DMA_EN                  SDH_DMA_EN
#define SDH_DMA_EN_POS              (0U)
#define SDH_DMA_EN_LEN              (1U)
#define SDH_DMA_EN_MSK              (((1U << SDH_DMA_EN_LEN) - 1) << SDH_DMA_EN_POS)
#define SDH_DMA_EN_UMSK             (~(((1U << SDH_DMA_EN_LEN) - 1) << SDH_DMA_EN_POS))
#define SDH_BLK_CNT_EN              SDH_BLK_CNT_EN
#define SDH_BLK_CNT_EN_POS          (1U)
#define SDH_BLK_CNT_EN_LEN          (1U)
#define SDH_BLK_CNT_EN_MSK          (((1U << SDH_BLK_CNT_EN_LEN) - 1) << SDH_BLK_CNT_EN_POS)
#define SDH_BLK_CNT_EN_UMSK         (~(((1U << SDH_BLK_CNT_EN_LEN) - 1) << SDH_BLK_CNT_EN_POS))
#define SDH_AUTO_CMD_EN             SDH_AUTO_CMD_EN
#define SDH_AUTO_CMD_EN_POS         (2U)
#define SDH_AUTO_CMD_EN_LEN         (2U)
#define SDH_AUTO_CMD_EN_MSK         (((1U << SDH_AUTO_CMD_EN_LEN) - 1) << SDH_AUTO_CMD_EN_POS)
#define SDH_AUTO_CMD_EN_UMSK        (~(((1U << SDH_AUTO_CMD_EN_LEN) - 1) << SDH_AUTO_CMD_EN_POS))
#define SDH_TO_HOST_DIR             SDH_TO_HOST_DIR
#define SDH_TO_HOST_DIR_POS         (4U)
#define SDH_TO_HOST_DIR_LEN         (1U)
#define SDH_TO_HOST_DIR_MSK         (((1U << SDH_TO_HOST_DIR_LEN) - 1) << SDH_TO_HOST_DIR_POS)
#define SDH_TO_HOST_DIR_UMSK        (~(((1U << SDH_TO_HOST_DIR_LEN) - 1) << SDH_TO_HOST_DIR_POS))
#define SDH_MULTI_BLK_SEL           SDH_MULTI_BLK_SEL
#define SDH_MULTI_BLK_SEL_POS       (5U)
#define SDH_MULTI_BLK_SEL_LEN       (1U)
#define SDH_MULTI_BLK_SEL_MSK       (((1U << SDH_MULTI_BLK_SEL_LEN) - 1) << SDH_MULTI_BLK_SEL_POS)
#define SDH_MULTI_BLK_SEL_UMSK      (~(((1U << SDH_MULTI_BLK_SEL_LEN) - 1) << SDH_MULTI_BLK_SEL_POS))

/* 0x0E : Command Register */
#define SDH_SD_CMD_OFFSET         (0x0E)
#define SDH_RESP_TYPE             SDH_RESP_TYPE
#define SDH_RESP_TYPE_POS         (0U)
#define SDH_RESP_TYPE_LEN         (2U)
#define SDH_RESP_TYPE_MSK         (((1U << SDH_RESP_TYPE_LEN) - 1) << SDH_RESP_TYPE_POS)
#define SDH_RESP_TYPE_UMSK        (~(((1U << SDH_RESP_TYPE_LEN) - 1) << SDH_RESP_TYPE_POS))
#define SDH_CMD_CRC_CHK_EN        SDH_CMD_CRC_CHK_EN
#define SDH_CMD_CRC_CHK_EN_POS    (3U)
#define SDH_CMD_CRC_CHK_EN_LEN    (1U)
#define SDH_CMD_CRC_CHK_EN_MSK    (((1U << SDH_CMD_CRC_CHK_EN_LEN) - 1) << SDH_CMD_CRC_CHK_EN_POS)
#define SDH_CMD_CRC_CHK_EN_UMSK   (~(((1U << SDH_CMD_CRC_CHK_EN_LEN) - 1) << SDH_CMD_CRC_CHK_EN_POS))
#define SDH_CMD_INDEX_CHK_EN      SDH_CMD_INDEX_CHK_EN
#define SDH_CMD_INDEX_CHK_EN_POS  (4U)
#define SDH_CMD_INDEX_CHK_EN_LEN  (1U)
#define SDH_CMD_INDEX_CHK_EN_MSK  (((1U << SDH_CMD_INDEX_CHK_EN_LEN) - 1) << SDH_CMD_INDEX_CHK_EN_POS)
#define SDH_CMD_INDEX_CHK_EN_UMSK (~(((1U << SDH_CMD_INDEX_CHK_EN_LEN) - 1) << SDH_CMD_INDEX_CHK_EN_POS))
#define SDH_DATA_PRESENT          SDH_DATA_PRESENT
#define SDH_DATA_PRESENT_POS      (5U)
#define SDH_DATA_PRESENT_LEN      (1U)
#define SDH_DATA_PRESENT_MSK      (((1U << SDH_DATA_PRESENT_LEN) - 1) << SDH_DATA_PRESENT_POS)
#define SDH_DATA_PRESENT_UMSK     (~(((1U << SDH_DATA_PRESENT_LEN) - 1) << SDH_DATA_PRESENT_POS))
#define SDH_CMD_TYPE              SDH_CMD_TYPE
#define SDH_CMD_TYPE_POS          (6U)
#define SDH_CMD_TYPE_LEN          (2U)
#define SDH_CMD_TYPE_MSK          (((1U << SDH_CMD_TYPE_LEN) - 1) << SDH_CMD_TYPE_POS)
#define SDH_CMD_TYPE_UMSK         (~(((1U << SDH_CMD_TYPE_LEN) - 1) << SDH_CMD_TYPE_POS))
#define SDH_CMD_INDEX             SDH_CMD_INDEX
#define SDH_CMD_INDEX_POS         (8U)
#define SDH_CMD_INDEX_LEN         (6U)
#define SDH_CMD_INDEX_MSK         (((1U << SDH_CMD_INDEX_LEN) - 1) << SDH_CMD_INDEX_POS)
#define SDH_CMD_INDEX_UMSK        (~(((1U << SDH_CMD_INDEX_LEN) - 1) << SDH_CMD_INDEX_POS))

/* 0x10 : Response Register 0 */
#define SDH_SD_RESP_0_OFFSET (0x10)
#define SDH_RESP0            SDH_RESP0
#define SDH_RESP0_POS        (0U)
#define SDH_RESP0_LEN        (16U)
#define SDH_RESP0_MSK        (((1U << SDH_RESP0_LEN) - 1) << SDH_RESP0_POS)
#define SDH_RESP0_UMSK       (~(((1U << SDH_RESP0_LEN) - 1) << SDH_RESP0_POS))

