RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/sdh_reg.h
/* 0x34 : Normal Interrupt Status Enable Register */
#define SDH_SD_NORMAL_INT_STATUS_EN_OFFSET (0x34)
#define SDH_CMD_COMPLETE_EN                SDH_CMD_COMPLETE_EN
#define SDH_CMD_COMPLETE_EN_POS            (0U)
#define SDH_CMD_COMPLETE_EN_LEN            (1U)
#define SDH_CMD_COMPLETE_EN_MSK            (((1U << SDH_CMD_COMPLETE_EN_LEN) - 1) << SDH_CMD_COMPLETE_EN_POS)
#define SDH_CMD_COMPLETE_EN_UMSK           (~(((1U << SDH_CMD_COMPLETE_EN_LEN) - 1) << SDH_CMD_COMPLETE_EN_POS))
#define SDH_XFER_COMPLETE_EN               SDH_XFER_COMPLETE_EN
#define SDH_XFER_COMPLETE_EN_POS           (1U)
#define SDH_XFER_COMPLETE_EN_LEN           (1U)
#define SDH_XFER_COMPLETE_EN_MSK           (((1U << SDH_XFER_COMPLETE_EN_LEN) - 1) << SDH_XFER_COMPLETE_EN_POS)
#define SDH_XFER_COMPLETE_EN_UMSK          (~(((1U << SDH_XFER_COMPLETE_EN_LEN) - 1) << SDH_XFER_COMPLETE_EN_POS))
#define SDH_BLOCK_GAP_EVT_EN               SDH_BLOCK_GAP_EVT_EN
#define SDH_BLOCK_GAP_EVT_EN_POS           (2U)
#define SDH_BLOCK_GAP_EVT_EN_LEN           (1U)
#define SDH_BLOCK_GAP_EVT_EN_MSK           (((1U << SDH_BLOCK_GAP_EVT_EN_LEN) - 1) << SDH_BLOCK_GAP_EVT_EN_POS)
#define SDH_BLOCK_GAP_EVT_EN_UMSK          (~(((1U << SDH_BLOCK_GAP_EVT_EN_LEN) - 1) << SDH_BLOCK_GAP_EVT_EN_POS))
#define SDH_DMA_INT_EN                     SDH_DMA_INT_EN
#define SDH_DMA_INT_EN_POS                 (3U)
#define SDH_DMA_INT_EN_LEN                 (1U)
#define SDH_DMA_INT_EN_MSK                 (((1U << SDH_DMA_INT_EN_LEN) - 1) << SDH_DMA_INT_EN_POS)
#define SDH_DMA_INT_EN_UMSK                (~(((1U << SDH_DMA_INT_EN_LEN) - 1) << SDH_DMA_INT_EN_POS))
#define SDH_TX_RDY_EN                      SDH_TX_RDY_EN
#define SDH_TX_RDY_EN_POS                  (4U)
#define SDH_TX_RDY_EN_LEN                  (1U)
#define SDH_TX_RDY_EN_MSK                  (((1U << SDH_TX_RDY_EN_LEN) - 1) << SDH_TX_RDY_EN_POS)
#define SDH_TX_RDY_EN_UMSK                 (~(((1U << SDH_TX_RDY_EN_LEN) - 1) << SDH_TX_RDY_EN_POS))
#define SDH_RD_RDY_EN                      SDH_RD_RDY_EN
#define SDH_RD_RDY_EN_POS                  (5U)
#define SDH_RD_RDY_EN_LEN                  (1U)
#define SDH_RD_RDY_EN_MSK                  (((1U << SDH_RD_RDY_EN_LEN) - 1) << SDH_RD_RDY_EN_POS)
#define SDH_RD_RDY_EN_UMSK                 (~(((1U << SDH_RD_RDY_EN_LEN) - 1) << SDH_RD_RDY_EN_POS))
#define SDH_CARD_INS_EN                    SDH_CARD_INS_EN
#define SDH_CARD_INS_EN_POS                (6U)
#define SDH_CARD_INS_EN_LEN                (1U)
#define SDH_CARD_INS_EN_MSK                (((1U << SDH_CARD_INS_EN_LEN) - 1) << SDH_CARD_INS_EN_POS)
#define SDH_CARD_INS_EN_UMSK               (~(((1U << SDH_CARD_INS_EN_LEN) - 1) << SDH_CARD_INS_EN_POS))
#define SDH_CARD_REM_EN                    SDH_CARD_REM_EN
#define SDH_CARD_REM_EN_POS                (7U)
#define SDH_CARD_REM_EN_LEN                (1U)
#define SDH_CARD_REM_EN_MSK                (((1U << SDH_CARD_REM_EN_LEN) - 1) << SDH_CARD_REM_EN_POS)
#define SDH_CARD_REM_EN_UMSK               (~(((1U << SDH_CARD_REM_EN_LEN) - 1) << SDH_CARD_REM_EN_POS))
#define SDH_CARD_INT_EN                    SDH_CARD_INT_EN
#define SDH_CARD_INT_EN_POS                (8U)
#define SDH_CARD_INT_EN_LEN                (1U)
#define SDH_CARD_INT_EN_MSK                (((1U << SDH_CARD_INT_EN_LEN) - 1) << SDH_CARD_INT_EN_POS)
#define SDH_CARD_INT_EN_UMSK               (~(((1U << SDH_CARD_INT_EN_LEN) - 1) << SDH_CARD_INT_EN_POS))
#define SDH_INT_A_INT_EN                   SDH_INT_A_INT_EN
#define SDH_INT_A_INT_EN_POS               (9U)
#define SDH_INT_A_INT_EN_LEN               (1U)
#define SDH_INT_A_INT_EN_MSK               (((1U << SDH_INT_A_INT_EN_LEN) - 1) << SDH_INT_A_INT_EN_POS)
#define SDH_INT_A_INT_EN_UMSK              (~(((1U << SDH_INT_A_INT_EN_LEN) - 1) << SDH_INT_A_INT_EN_POS))
#define SDH_INT_B_INT_EN                   SDH_INT_B_INT_EN
#define SDH_INT_B_INT_EN_POS               (10U)
#define SDH_INT_B_INT_EN_LEN               (1U)
#define SDH_INT_B_INT_EN_MSK               (((1U << SDH_INT_B_INT_EN_LEN) - 1) << SDH_INT_B_INT_EN_POS)
#define SDH_INT_B_INT_EN_UMSK              (~(((1U << SDH_INT_B_INT_EN_LEN) - 1) << SDH_INT_B_INT_EN_POS))
#define SDH_INT_C_INT_EN                   SDH_INT_C_INT_EN
#define SDH_INT_C_INT_EN_POS               (11U)
#define SDH_INT_C_INT_EN_LEN               (1U)
#define SDH_INT_C_INT_EN_MSK               (((1U << SDH_INT_C_INT_EN_LEN) - 1) << SDH_INT_C_INT_EN_POS)
#define SDH_INT_C_INT_EN_UMSK              (~(((1U << SDH_INT_C_INT_EN_LEN) - 1) << SDH_INT_C_INT_EN_POS))
#define SDH_RETUNE_INT_EN                  SDH_RETUNE_INT_EN
#define SDH_RETUNE_INT_EN_POS              (12U)
#define SDH_RETUNE_INT_EN_LEN              (1U)
#define SDH_RETUNE_INT_EN_MSK              (((1U << SDH_RETUNE_INT_EN_LEN) - 1) << SDH_RETUNE_INT_EN_POS)
#define SDH_RETUNE_INT_EN_UMSK             (~(((1U << SDH_RETUNE_INT_EN_LEN) - 1) << SDH_RETUNE_INT_EN_POS))

/* 0x36 : Error Interrupt Status Enable Register */
#define SDH_SD_ERROR_INT_STATUS_EN_OFFSET (0x36)
#define SDH_CMD_TIMEOUT_ERR_EN            SDH_CMD_TIMEOUT_ERR_EN
#define SDH_CMD_TIMEOUT_ERR_EN_POS        (0U)
#define SDH_CMD_TIMEOUT_ERR_EN_LEN        (1U)
#define SDH_CMD_TIMEOUT_ERR_EN_MSK        (((1U << SDH_CMD_TIMEOUT_ERR_EN_LEN) - 1) << SDH_CMD_TIMEOUT_ERR_EN_POS)
#define SDH_CMD_TIMEOUT_ERR_EN_UMSK       (~(((1U << SDH_CMD_TIMEOUT_ERR_EN_LEN) - 1) << SDH_CMD_TIMEOUT_ERR_EN_POS))
#define SDH_CMD_CRC_ERR_EN                SDH_CMD_CRC_ERR_EN
#define SDH_CMD_CRC_ERR_EN_POS            (1U)
#define SDH_CMD_CRC_ERR_EN_LEN            (1U)
#define SDH_CMD_CRC_ERR_EN_MSK            (((1U << SDH_CMD_CRC_ERR_EN_LEN) - 1) << SDH_CMD_CRC_ERR_EN_POS)
#define SDH_CMD_CRC_ERR_EN_UMSK           (~(((1U << SDH_CMD_CRC_ERR_EN_LEN) - 1) << SDH_CMD_CRC_ERR_EN_POS))
#define SDH_CMD_END_BIT_ERR_EN            SDH_CMD_END_BIT_ERR_EN
#define SDH_CMD_END_BIT_ERR_EN_POS        (2U)
#define SDH_CMD_END_BIT_ERR_EN_LEN        (1U)
#define SDH_CMD_END_BIT_ERR_EN_MSK        (((1U << SDH_CMD_END_BIT_ERR_EN_LEN) - 1) << SDH_CMD_END_BIT_ERR_EN_POS)
#define SDH_CMD_END_BIT_ERR_EN_UMSK       (~(((1U << SDH_CMD_END_BIT_ERR_EN_LEN) - 1) << SDH_CMD_END_BIT_ERR_EN_POS))
#define SDH_CMD_INDEX_ERR_EN              SDH_CMD_INDEX_ERR_EN
#define SDH_CMD_INDEX_ERR_EN_POS          (3U)
#define SDH_CMD_INDEX_ERR_EN_LEN          (1U)
#define SDH_CMD_INDEX_ERR_EN_MSK          (((1U << SDH_CMD_INDEX_ERR_EN_LEN) - 1) << SDH_CMD_INDEX_ERR_EN_POS)
#define SDH_CMD_INDEX_ERR_EN_UMSK         (~(((1U << SDH_CMD_INDEX_ERR_EN_LEN) - 1) << SDH_CMD_INDEX_ERR_EN_POS))
#define SDH_DATA_TIMEOUT_ERR_EN           SDH_DATA_TIMEOUT_ERR_EN
#define SDH_DATA_TIMEOUT_ERR_EN_POS       (4U)
#define SDH_DATA_TIMEOUT_ERR_EN_LEN       (1U)
#define SDH_DATA_TIMEOUT_ERR_EN_MSK       (((1U << SDH_DATA_TIMEOUT_ERR_EN_LEN) - 1) << SDH_DATA_TIMEOUT_ERR_EN_POS)
#define SDH_DATA_TIMEOUT_ERR_EN_UMSK      (~(((1U << SDH_DATA_TIMEOUT_ERR_EN_LEN) - 1) << SDH_DATA_TIMEOUT_ERR_EN_POS))
#define SDH_RD_DATA_CRC_ERR_EN            SDH_RD_DATA_CRC_ERR_EN
#define SDH_RD_DATA_CRC_ERR_EN_POS        (5U)
#define SDH_RD_DATA_CRC_ERR_EN_LEN        (1U)
#define SDH_RD_DATA_CRC_ERR_EN_MSK        (((1U << SDH_RD_DATA_CRC_ERR_EN_LEN) - 1) << SDH_RD_DATA_CRC_ERR_EN_POS)
#define SDH_RD_DATA_CRC_ERR_EN_UMSK       (~(((1U << SDH_RD_DATA_CRC_ERR_EN_LEN) - 1) << SDH_RD_DATA_CRC_ERR_EN_POS))
#define SDH_RD_DATA_END_BIT_ERR_EN        SDH_RD_DATA_END_BIT_ERR_EN
#define SDH_RD_DATA_END_BIT_ERR_EN_POS    (6U)
#define SDH_RD_DATA_END_BIT_ERR_EN_LEN    (1U)
#define SDH_RD_DATA_END_BIT_ERR_EN_MSK    (((1U << SDH_RD_DATA_END_BIT_ERR_EN_LEN) - 1) << SDH_RD_DATA_END_BIT_ERR_EN_POS)
#define SDH_RD_DATA_END_BIT_ERR_EN_UMSK   (~(((1U << SDH_RD_DATA_END_BIT_ERR_EN_LEN) - 1) << SDH_RD_DATA_END_BIT_ERR_EN_POS))
#define SDH_CUR_LIM_ERR_EN                SDH_CUR_LIM_ERR_EN
#define SDH_CUR_LIM_ERR_EN_POS            (7U)
#define SDH_CUR_LIM_ERR_EN_LEN            (1U)
#define SDH_CUR_LIM_ERR_EN_MSK            (((1U << SDH_CUR_LIM_ERR_EN_LEN) - 1) << SDH_CUR_LIM_ERR_EN_POS)
#define SDH_CUR_LIM_ERR_EN_UMSK           (~(((1U << SDH_CUR_LIM_ERR_EN_LEN) - 1) << SDH_CUR_LIM_ERR_EN_POS))
#define SDH_AUTO_CMD12_ERR_EN             SDH_AUTO_CMD12_ERR_EN
#define SDH_AUTO_CMD12_ERR_EN_POS         (8U)
#define SDH_AUTO_CMD12_ERR_EN_LEN         (1U)
#define SDH_AUTO_CMD12_ERR_EN_MSK         (((1U << SDH_AUTO_CMD12_ERR_EN_LEN) - 1) << SDH_AUTO_CMD12_ERR_EN_POS)
#define SDH_AUTO_CMD12_ERR_EN_UMSK        (~(((1U << SDH_AUTO_CMD12_ERR_EN_LEN) - 1) << SDH_AUTO_CMD12_ERR_EN_POS))
#define SDH_ADMA_ERR_EN                   SDH_ADMA_ERR_EN
#define SDH_ADMA_ERR_EN_POS               (9U)
#define SDH_ADMA_ERR_EN_LEN               (1U)
#define SDH_ADMA_ERR_EN_MSK               (((1U << SDH_ADMA_ERR_EN_LEN) - 1) << SDH_ADMA_ERR_EN_POS)
#define SDH_ADMA_ERR_EN_UMSK              (~(((1U << SDH_ADMA_ERR_EN_LEN) - 1) << SDH_ADMA_ERR_EN_POS))
#define SDH_TUNING_ERR_EN                 SDH_TUNING_ERR_EN
#define SDH_TUNING_ERR_EN_POS             (10U)
#define SDH_TUNING_ERR_EN_LEN             (1U)
#define SDH_TUNING_ERR_EN_MSK             (((1U << SDH_TUNING_ERR_EN_LEN) - 1) << SDH_TUNING_ERR_EN_POS)
#define SDH_TUNING_ERR_EN_UMSK            (~(((1U << SDH_TUNING_ERR_EN_LEN) - 1) << SDH_TUNING_ERR_EN_POS))
#define SDH_SPI_ERR_EN                    SDH_SPI_ERR_EN
#define SDH_SPI_ERR_EN_POS                (12U)
#define SDH_SPI_ERR_EN_LEN                (1U)
#define SDH_SPI_ERR_EN_MSK                (((1U << SDH_SPI_ERR_EN_LEN) - 1) << SDH_SPI_ERR_EN_POS)
#define SDH_SPI_ERR_EN_UMSK               (~(((1U << SDH_SPI_ERR_EN_LEN) - 1) << SDH_SPI_ERR_EN_POS))
#define SDH_AXI_RESP_ERR_EN               SDH_AXI_RESP_ERR_EN
#define SDH_AXI_RESP_ERR_EN_POS           (13U)
#define SDH_AXI_RESP_ERR_EN_LEN           (1U)
#define SDH_AXI_RESP_ERR_EN_MSK           (((1U << SDH_AXI_RESP_ERR_EN_LEN) - 1) << SDH_AXI_RESP_ERR_EN_POS)
#define SDH_AXI_RESP_ERR_EN_UMSK          (~(((1U << SDH_AXI_RESP_ERR_EN_LEN) - 1) << SDH_AXI_RESP_ERR_EN_POS))
#define SDH_CPL_TIMEOUT_ERR_EN            SDH_CPL_TIMEOUT_ERR_EN
#define SDH_CPL_TIMEOUT_ERR_EN_POS        (14U)
#define SDH_CPL_TIMEOUT_ERR_EN_LEN        (1U)
#define SDH_CPL_TIMEOUT_ERR_EN_MSK        (((1U << SDH_CPL_TIMEOUT_ERR_EN_LEN) - 1) << SDH_CPL_TIMEOUT_ERR_EN_POS)
#define SDH_CPL_TIMEOUT_ERR_EN_UMSK       (~(((1U << SDH_CPL_TIMEOUT_ERR_EN_LEN) - 1) << SDH_CPL_TIMEOUT_ERR_EN_POS))
#define SDH_CRC_STATUS_ERR_EN             SDH_CRC_STATUS_ERR_EN
#define SDH_CRC_STATUS_ERR_EN_POS         (15U)
#define SDH_CRC_STATUS_ERR_EN_LEN         (1U)
#define SDH_CRC_STATUS_ERR_EN_MSK         (((1U << SDH_CRC_STATUS_ERR_EN_LEN) - 1) << SDH_CRC_STATUS_ERR_EN_POS)
#define SDH_CRC_STATUS_ERR_EN_UMSK        (~(((1U << SDH_CRC_STATUS_ERR_EN_LEN) - 1) << SDH_CRC_STATUS_ERR_EN_POS))

