RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/sdh_reg.h
/* 0x46 : Capabilities Register 4 */
#define SDH_SD_CAPABILITIES_4_OFFSET (0x46)
#define SDH_CLK_MULTIPLIER           SDH_CLK_MULTIPLIER
#define SDH_CLK_MULTIPLIER_POS       (0U)
#define SDH_CLK_MULTIPLIER_LEN       (8U)
#define SDH_CLK_MULTIPLIER_MSK       (((1U << SDH_CLK_MULTIPLIER_LEN) - 1) << SDH_CLK_MULTIPLIER_POS)
#define SDH_CLK_MULTIPLIER_UMSK      (~(((1U << SDH_CLK_MULTIPLIER_LEN) - 1) << SDH_CLK_MULTIPLIER_POS))

/* 0x48 : Maximum Current Register 1 */
#define SDH_SD_MAX_CURRENT_1_OFFSET (0x48)
#define SDH_MAX_CUR_33              SDH_MAX_CUR_33
#define SDH_MAX_CUR_33_POS          (0U)
#define SDH_MAX_CUR_33_LEN          (8U)
#define SDH_MAX_CUR_33_MSK          (((1U << SDH_MAX_CUR_33_LEN) - 1) << SDH_MAX_CUR_33_POS)
#define SDH_MAX_CUR_33_UMSK         (~(((1U << SDH_MAX_CUR_33_LEN) - 1) << SDH_MAX_CUR_33_POS))
#define SDH_MAX_CUR_30              SDH_MAX_CUR_30
#define SDH_MAX_CUR_30_POS          (8U)
#define SDH_MAX_CUR_30_LEN          (8U)
#define SDH_MAX_CUR_30_MSK          (((1U << SDH_MAX_CUR_30_LEN) - 1) << SDH_MAX_CUR_30_POS)
#define SDH_MAX_CUR_30_UMSK         (~(((1U << SDH_MAX_CUR_30_LEN) - 1) << SDH_MAX_CUR_30_POS))

/* 0x4A : Maximum Current Register 2 */
#define SDH_SD_MAX_CURRENT_2_OFFSET (0x4A)
#define SDH_MAX_CUR_18              SDH_MAX_CUR_18
#define SDH_MAX_CUR_18_POS          (0U)
#define SDH_MAX_CUR_18_LEN          (8U)
#define SDH_MAX_CUR_18_MSK          (((1U << SDH_MAX_CUR_18_LEN) - 1) << SDH_MAX_CUR_18_POS)
#define SDH_MAX_CUR_18_UMSK         (~(((1U << SDH_MAX_CUR_18_LEN) - 1) << SDH_MAX_CUR_18_POS))

/* 0x4C : Maximum Current Register 3 */
#define SDH_SD_MAX_CURRENT_3_OFFSET (0x4C)

/* 0x4E : Maximum Current Register 4 */
#define SDH_SD_MAX_CURRENT_4_OFFSET (0x4E)

/* 0x50 : Force Event Auto cmd12 Error Register */
#define SDH_SD_FORCE_EVENT_AUTO_CMD12_ERROR_OFFSET (0x50)
#define SDH_F_ACMD12_NEXE_ERR                      SDH_F_ACMD12_NEXE_ERR
#define SDH_F_ACMD12_NEXE_ERR_POS                  (0U)
#define SDH_F_ACMD12_NEXE_ERR_LEN                  (1U)
#define SDH_F_ACMD12_NEXE_ERR_MSK                  (((1U << SDH_F_ACMD12_NEXE_ERR_LEN) - 1) << SDH_F_ACMD12_NEXE_ERR_POS)
#define SDH_F_ACMD12_NEXE_ERR_UMSK                 (~(((1U << SDH_F_ACMD12_NEXE_ERR_LEN) - 1) << SDH_F_ACMD12_NEXE_ERR_POS))
#define SDH_F_ACMD_TO_ERR                          SDH_F_ACMD_TO_ERR
#define SDH_F_ACMD_TO_ERR_POS                      (1U)
#define SDH_F_ACMD_TO_ERR_LEN                      (1U)
#define SDH_F_ACMD_TO_ERR_MSK                      (((1U << SDH_F_ACMD_TO_ERR_LEN) - 1) << SDH_F_ACMD_TO_ERR_POS)
#define SDH_F_ACMD_TO_ERR_UMSK                     (~(((1U << SDH_F_ACMD_TO_ERR_LEN) - 1) << SDH_F_ACMD_TO_ERR_POS))
#define SDH_F_ACMD_CRC_ERR                         SDH_F_ACMD_CRC_ERR
#define SDH_F_ACMD_CRC_ERR_POS                     (2U)
#define SDH_F_ACMD_CRC_ERR_LEN                     (1U)
#define SDH_F_ACMD_CRC_ERR_MSK                     (((1U << SDH_F_ACMD_CRC_ERR_LEN) - 1) << SDH_F_ACMD_CRC_ERR_POS)
#define SDH_F_ACMD_CRC_ERR_UMSK                    (~(((1U << SDH_F_ACMD_CRC_ERR_LEN) - 1) << SDH_F_ACMD_CRC_ERR_POS))
#define SDH_F__ACMD_EBIT_ERR                       SDH_F__ACMD_EBIT_ERR
#define SDH_F__ACMD_EBIT_ERR_POS                   (3U)
#define SDH_F__ACMD_EBIT_ERR_LEN                   (1U)
#define SDH_F__ACMD_EBIT_ERR_MSK                   (((1U << SDH_F__ACMD_EBIT_ERR_LEN) - 1) << SDH_F__ACMD_EBIT_ERR_POS)
#define SDH_F__ACMD_EBIT_ERR_UMSK                  (~(((1U << SDH_F__ACMD_EBIT_ERR_LEN) - 1) << SDH_F__ACMD_EBIT_ERR_POS))
#define SDH_F_ACMD_INDEX_ERR                       SDH_F_ACMD_INDEX_ERR
#define SDH_F_ACMD_INDEX_ERR_POS                   (4U)
#define SDH_F_ACMD_INDEX_ERR_LEN                   (1U)
#define SDH_F_ACMD_INDEX_ERR_MSK                   (((1U << SDH_F_ACMD_INDEX_ERR_LEN) - 1) << SDH_F_ACMD_INDEX_ERR_POS)
#define SDH_F_ACMD_INDEX_ERR_UMSK                  (~(((1U << SDH_F_ACMD_INDEX_ERR_LEN) - 1) << SDH_F_ACMD_INDEX_ERR_POS))
#define SDH_F_ACMD12_ISSUE_ERR                     SDH_F_ACMD12_ISSUE_ERR
#define SDH_F_ACMD12_ISSUE_ERR_POS                 (7U)
#define SDH_F_ACMD12_ISSUE_ERR_LEN                 (1U)
#define SDH_F_ACMD12_ISSUE_ERR_MSK                 (((1U << SDH_F_ACMD12_ISSUE_ERR_LEN) - 1) << SDH_F_ACMD12_ISSUE_ERR_POS)
#define SDH_F_ACMD12_ISSUE_ERR_UMSK                (~(((1U << SDH_F_ACMD12_ISSUE_ERR_LEN) - 1) << SDH_F_ACMD12_ISSUE_ERR_POS))

/* 0x52 : Force Event for Error Status Register */
#define SDH_SD_FORCE_EVENT_FOR_ERROR_STATUS_OFFSET (0x52)
#define SDH_F_CMD_TO_ERR                           SDH_F_CMD_TO_ERR
#define SDH_F_CMD_TO_ERR_POS                       (0U)
#define SDH_F_CMD_TO_ERR_LEN                       (1U)
#define SDH_F_CMD_TO_ERR_MSK                       (((1U << SDH_F_CMD_TO_ERR_LEN) - 1) << SDH_F_CMD_TO_ERR_POS)
#define SDH_F_CMD_TO_ERR_UMSK                      (~(((1U << SDH_F_CMD_TO_ERR_LEN) - 1) << SDH_F_CMD_TO_ERR_POS))
#define SDH_F_CMD_CRC_ERR                          SDH_F_CMD_CRC_ERR
#define SDH_F_CMD_CRC_ERR_POS                      (1U)
#define SDH_F_CMD_CRC_ERR_LEN                      (1U)
#define SDH_F_CMD_CRC_ERR_MSK                      (((1U << SDH_F_CMD_CRC_ERR_LEN) - 1) << SDH_F_CMD_CRC_ERR_POS)
#define SDH_F_CMD_CRC_ERR_UMSK                     (~(((1U << SDH_F_CMD_CRC_ERR_LEN) - 1) << SDH_F_CMD_CRC_ERR_POS))
#define SDH_F_CMD_END_BIT_ERR                      SDH_F_CMD_END_BIT_ERR
#define SDH_F_CMD_END_BIT_ERR_POS                  (2U)
#define SDH_F_CMD_END_BIT_ERR_LEN                  (1U)
#define SDH_F_CMD_END_BIT_ERR_MSK                  (((1U << SDH_F_CMD_END_BIT_ERR_LEN) - 1) << SDH_F_CMD_END_BIT_ERR_POS)
#define SDH_F_CMD_END_BIT_ERR_UMSK                 (~(((1U << SDH_F_CMD_END_BIT_ERR_LEN) - 1) << SDH_F_CMD_END_BIT_ERR_POS))
#define SDH_F_CMD_INDEX_ERR                        SDH_F_CMD_INDEX_ERR
#define SDH_F_CMD_INDEX_ERR_POS                    (3U)
#define SDH_F_CMD_INDEX_ERR_LEN                    (1U)
#define SDH_F_CMD_INDEX_ERR_MSK                    (((1U << SDH_F_CMD_INDEX_ERR_LEN) - 1) << SDH_F_CMD_INDEX_ERR_POS)
#define SDH_F_CMD_INDEX_ERR_UMSK                   (~(((1U << SDH_F_CMD_INDEX_ERR_LEN) - 1) << SDH_F_CMD_INDEX_ERR_POS))
#define SDH_F_DAT_TO_ERR                           SDH_F_DAT_TO_ERR
#define SDH_F_DAT_TO_ERR_POS                       (4U)
#define SDH_F_DAT_TO_ERR_LEN                       (1U)
#define SDH_F_DAT_TO_ERR_MSK                       (((1U << SDH_F_DAT_TO_ERR_LEN) - 1) << SDH_F_DAT_TO_ERR_POS)
#define SDH_F_DAT_TO_ERR_UMSK                      (~(((1U << SDH_F_DAT_TO_ERR_LEN) - 1) << SDH_F_DAT_TO_ERR_POS))
#define SDH_F_DAT_CRC_ERR                          SDH_F_DAT_CRC_ERR
#define SDH_F_DAT_CRC_ERR_POS                      (5U)
#define SDH_F_DAT_CRC_ERR_LEN                      (1U)
#define SDH_F_DAT_CRC_ERR_MSK                      (((1U << SDH_F_DAT_CRC_ERR_LEN) - 1) << SDH_F_DAT_CRC_ERR_POS)
#define SDH_F_DAT_CRC_ERR_UMSK                     (~(((1U << SDH_F_DAT_CRC_ERR_LEN) - 1) << SDH_F_DAT_CRC_ERR_POS))
#define SDH_F_DAT_END_BIT_ERR                      SDH_F_DAT_END_BIT_ERR
#define SDH_F_DAT_END_BIT_ERR_POS                  (6U)
#define SDH_F_DAT_END_BIT_ERR_LEN                  (1U)
#define SDH_F_DAT_END_BIT_ERR_MSK                  (((1U << SDH_F_DAT_END_BIT_ERR_LEN) - 1) << SDH_F_DAT_END_BIT_ERR_POS)
#define SDH_F_DAT_END_BIT_ERR_UMSK                 (~(((1U << SDH_F_DAT_END_BIT_ERR_LEN) - 1) << SDH_F_DAT_END_BIT_ERR_POS))
#define SDH_F_CURRENT_ERR                          SDH_F_CURRENT_ERR
#define SDH_F_CURRENT_ERR_POS                      (7U)
#define SDH_F_CURRENT_ERR_LEN                      (1U)
#define SDH_F_CURRENT_ERR_MSK                      (((1U << SDH_F_CURRENT_ERR_LEN) - 1) << SDH_F_CURRENT_ERR_POS)
#define SDH_F_CURRENT_ERR_UMSK                     (~(((1U << SDH_F_CURRENT_ERR_LEN) - 1) << SDH_F_CURRENT_ERR_POS))
#define SDH_F_ACMD12_ERR                           SDH_F_ACMD12_ERR
#define SDH_F_ACMD12_ERR_POS                       (8U)
#define SDH_F_ACMD12_ERR_LEN                       (1U)
#define SDH_F_ACMD12_ERR_MSK                       (((1U << SDH_F_ACMD12_ERR_LEN) - 1) << SDH_F_ACMD12_ERR_POS)
#define SDH_F_ACMD12_ERR_UMSK                      (~(((1U << SDH_F_ACMD12_ERR_LEN) - 1) << SDH_F_ACMD12_ERR_POS))
#define SDH_F_ADMA_ERR                             SDH_F_ADMA_ERR
#define SDH_F_ADMA_ERR_POS                         (9U)
#define SDH_F_ADMA_ERR_LEN                         (1U)
#define SDH_F_ADMA_ERR_MSK                         (((1U << SDH_F_ADMA_ERR_LEN) - 1) << SDH_F_ADMA_ERR_POS)
#define SDH_F_ADMA_ERR_UMSK                        (~(((1U << SDH_F_ADMA_ERR_LEN) - 1) << SDH_F_ADMA_ERR_POS))
#define SDH_F_SPI_ERR                              SDH_F_SPI_ERR
#define SDH_F_SPI_ERR_POS                          (12U)
#define SDH_F_SPI_ERR_LEN                          (1U)
#define SDH_F_SPI_ERR_MSK                          (((1U << SDH_F_SPI_ERR_LEN) - 1) << SDH_F_SPI_ERR_POS)
#define SDH_F_SPI_ERR_UMSK                         (~(((1U << SDH_F_SPI_ERR_LEN) - 1) << SDH_F_SPI_ERR_POS))
#define SDH_F_AXI_RESP_ERR                         SDH_F_AXI_RESP_ERR
#define SDH_F_AXI_RESP_ERR_POS                     (13U)
#define SDH_F_AXI_RESP_ERR_LEN                     (1U)
#define SDH_F_AXI_RESP_ERR_MSK                     (((1U << SDH_F_AXI_RESP_ERR_LEN) - 1) << SDH_F_AXI_RESP_ERR_POS)
#define SDH_F_AXI_RESP_ERR_UMSK                    (~(((1U << SDH_F_AXI_RESP_ERR_LEN) - 1) << SDH_F_AXI_RESP_ERR_POS))
#define SDH_F_CPL_TIMEOUT_ERR                      SDH_F_CPL_TIMEOUT_ERR
#define SDH_F_CPL_TIMEOUT_ERR_POS                  (14U)
#define SDH_F_CPL_TIMEOUT_ERR_LEN                  (1U)
#define SDH_F_CPL_TIMEOUT_ERR_MSK                  (((1U << SDH_F_CPL_TIMEOUT_ERR_LEN) - 1) << SDH_F_CPL_TIMEOUT_ERR_POS)
#define SDH_F_CPL_TIMEOUT_ERR_UMSK                 (~(((1U << SDH_F_CPL_TIMEOUT_ERR_LEN) - 1) << SDH_F_CPL_TIMEOUT_ERR_POS))
#define SDH_F_CRC_STATUS_ERR                       SDH_F_CRC_STATUS_ERR
#define SDH_F_CRC_STATUS_ERR_POS                   (15U)
#define SDH_F_CRC_STATUS_ERR_LEN                   (1U)
#define SDH_F_CRC_STATUS_ERR_MSK                   (((1U << SDH_F_CRC_STATUS_ERR_LEN) - 1) << SDH_F_CRC_STATUS_ERR_POS)
#define SDH_F_CRC_STATUS_ERR_UMSK                  (~(((1U << SDH_F_CRC_STATUS_ERR_LEN) - 1) << SDH_F_CRC_STATUS_ERR_POS))

/* 0x54 : ADMA Error Status Register */
#define SDH_SD_ADMA_ERROR_STATUS_OFFSET (0x54)
#define SDH_ADMA_STATE                  SDH_ADMA_STATE
#define SDH_ADMA_STATE_POS              (0U)
#define SDH_ADMA_STATE_LEN              (2U)
#define SDH_ADMA_STATE_MSK              (((1U << SDH_ADMA_STATE_LEN) - 1) << SDH_ADMA_STATE_POS)
#define SDH_ADMA_STATE_UMSK             (~(((1U << SDH_ADMA_STATE_LEN) - 1) << SDH_ADMA_STATE_POS))
#define SDH_ADMA_LEN_ERR                SDH_ADMA_LEN_ERR
#define SDH_ADMA_LEN_ERR_POS            (2U)
#define SDH_ADMA_LEN_ERR_LEN            (1U)
#define SDH_ADMA_LEN_ERR_MSK            (((1U << SDH_ADMA_LEN_ERR_LEN) - 1) << SDH_ADMA_LEN_ERR_POS)
#define SDH_ADMA_LEN_ERR_UMSK           (~(((1U << SDH_ADMA_LEN_ERR_LEN) - 1) << SDH_ADMA_LEN_ERR_POS))

/* 0x58 : ADMA System Address Register 1 */
#define SDH_SD_ADMA_SYS_ADDR_1_OFFSET (0x58)
#define SDH_ADMA_SYS_ADDR             SDH_ADMA_SYS_ADDR
#define SDH_ADMA_SYS_ADDR_POS         (0U)
#define SDH_ADMA_SYS_ADDR_LEN         (16U)
#define SDH_ADMA_SYS_ADDR_MSK         (((1U << SDH_ADMA_SYS_ADDR_LEN) - 1) << SDH_ADMA_SYS_ADDR_POS)
#define SDH_ADMA_SYS_ADDR_UMSK        (~(((1U << SDH_ADMA_SYS_ADDR_LEN) - 1) << SDH_ADMA_SYS_ADDR_POS))

/* 0x5A : ADMA System Address Register 2 */
#define SDH_SD_ADMA_SYS_ADDR_2_OFFSET (0x5A)
#define SDH_ADMA_SYS_ADDR             SDH_ADMA_SYS_ADDR
#define SDH_ADMA_SYS_ADDR_POS         (0U)
#define SDH_ADMA_SYS_ADDR_LEN         (16U)
#define SDH_ADMA_SYS_ADDR_MSK         (((1U << SDH_ADMA_SYS_ADDR_LEN) - 1) << SDH_ADMA_SYS_ADDR_POS)
#define SDH_ADMA_SYS_ADDR_UMSK        (~(((1U << SDH_ADMA_SYS_ADDR_LEN) - 1) << SDH_ADMA_SYS_ADDR_POS))

/* 0x5C : ADMA System Address Register 3 */
#define SDH_SD_ADMA_SYS_ADDR_3_OFFSET (0x5C)
#define SDH_ADMA_SYS_ADDR             SDH_ADMA_SYS_ADDR
#define SDH_ADMA_SYS_ADDR_POS         (0U)
#define SDH_ADMA_SYS_ADDR_LEN         (16U)
#define SDH_ADMA_SYS_ADDR_MSK         (((1U << SDH_ADMA_SYS_ADDR_LEN) - 1) << SDH_ADMA_SYS_ADDR_POS)
#define SDH_ADMA_SYS_ADDR_UMSK        (~(((1U << SDH_ADMA_SYS_ADDR_LEN) - 1) << SDH_ADMA_SYS_ADDR_POS))

