RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/sdh_reg.h
/* 0x104 : FIFO Parameters Register */
#define SDH_SD_FIFO_PARAM_OFFSET  (0x104)
#define SDH_RTC                   SDH_RTC
#define SDH_RTC_POS               (0U)
#define SDH_RTC_LEN               (2U)
#define SDH_RTC_MSK               (((1U << SDH_RTC_LEN) - 1) << SDH_RTC_POS)
#define SDH_RTC_UMSK              (~(((1U << SDH_RTC_LEN) - 1) << SDH_RTC_POS))
#define SDH_WTC                   SDH_WTC
#define SDH_WTC_POS               (2U)
#define SDH_WTC_LEN               (2U)
#define SDH_WTC_MSK               (((1U << SDH_WTC_LEN) - 1) << SDH_WTC_POS)
#define SDH_WTC_UMSK              (~(((1U << SDH_WTC_LEN) - 1) << SDH_WTC_POS))
#define SDH_FIFO_CLK              SDH_FIFO_CLK
#define SDH_FIFO_CLK_POS          (4U)
#define SDH_FIFO_CLK_LEN          (1U)
#define SDH_FIFO_CLK_MSK          (((1U << SDH_FIFO_CLK_LEN) - 1) << SDH_FIFO_CLK_POS)
#define SDH_FIFO_CLK_UMSK         (~(((1U << SDH_FIFO_CLK_LEN) - 1) << SDH_FIFO_CLK_POS))
#define SDH_FIFO_CS               SDH_FIFO_CS
#define SDH_FIFO_CS_POS           (5U)
#define SDH_FIFO_CS_LEN           (1U)
#define SDH_FIFO_CS_MSK           (((1U << SDH_FIFO_CS_LEN) - 1) << SDH_FIFO_CS_POS)
#define SDH_FIFO_CS_UMSK          (~(((1U << SDH_FIFO_CS_LEN) - 1) << SDH_FIFO_CS_POS))
#define SDH_PDWN                  SDH_PDWN
#define SDH_PDWN_POS              (6U)
#define SDH_PDWN_LEN              (1U)
#define SDH_PDWN_MSK              (((1U << SDH_PDWN_LEN) - 1) << SDH_PDWN_POS)
#define SDH_PDWN_UMSK             (~(((1U << SDH_PDWN_LEN) - 1) << SDH_PDWN_POS))
#define SDH_USE_DAT3              SDH_USE_DAT3
#define SDH_USE_DAT3_POS          (7U)
#define SDH_USE_DAT3_LEN          (1U)
#define SDH_USE_DAT3_MSK          (((1U << SDH_USE_DAT3_LEN) - 1) << SDH_USE_DAT3_POS)
#define SDH_USE_DAT3_UMSK         (~(((1U << SDH_USE_DAT3_LEN) - 1) << SDH_USE_DAT3_POS))
#define SDH_CLK_GATE_CTL          SDH_CLK_GATE_CTL
#define SDH_CLK_GATE_CTL_POS      (8U)
#define SDH_CLK_GATE_CTL_LEN      (1U)
#define SDH_CLK_GATE_CTL_MSK      (((1U << SDH_CLK_GATE_CTL_LEN) - 1) << SDH_CLK_GATE_CTL_POS)
#define SDH_CLK_GATE_CTL_UMSK     (~(((1U << SDH_CLK_GATE_CTL_LEN) - 1) << SDH_CLK_GATE_CTL_POS))
#define SDH_CLK_GATE_ON           SDH_CLK_GATE_ON
#define SDH_CLK_GATE_ON_POS       (9U)
#define SDH_CLK_GATE_ON_LEN       (1U)
#define SDH_CLK_GATE_ON_MSK       (((1U << SDH_CLK_GATE_ON_LEN) - 1) << SDH_CLK_GATE_ON_POS)
#define SDH_CLK_GATE_ON_UMSK      (~(((1U << SDH_CLK_GATE_ON_LEN) - 1) << SDH_CLK_GATE_ON_POS))
#define SDH_OVRRD_CLK_OEN         SDH_OVRRD_CLK_OEN
#define SDH_OVRRD_CLK_OEN_POS     (11U)
#define SDH_OVRRD_CLK_OEN_LEN     (1U)
#define SDH_OVRRD_CLK_OEN_MSK     (((1U << SDH_OVRRD_CLK_OEN_LEN) - 1) << SDH_OVRRD_CLK_OEN_POS)
#define SDH_OVRRD_CLK_OEN_UMSK    (~(((1U << SDH_OVRRD_CLK_OEN_LEN) - 1) << SDH_OVRRD_CLK_OEN_POS))
#define SDH_FORCE_CLK_ON          SDH_FORCE_CLK_ON
#define SDH_FORCE_CLK_ON_POS      (12U)
#define SDH_FORCE_CLK_ON_LEN      (1U)
#define SDH_FORCE_CLK_ON_MSK      (((1U << SDH_FORCE_CLK_ON_LEN) - 1) << SDH_FORCE_CLK_ON_POS)
#define SDH_FORCE_CLK_ON_UMSK     (~(((1U << SDH_FORCE_CLK_ON_LEN) - 1) << SDH_FORCE_CLK_ON_POS))
#define SDH_PDFVSSM               SDH_PDFVSSM
#define SDH_PDFVSSM_POS           (13U)
#define SDH_PDFVSSM_LEN           (1U)
#define SDH_PDFVSSM_MSK           (((1U << SDH_PDFVSSM_LEN) - 1) << SDH_PDFVSSM_POS)
#define SDH_PDFVSSM_UMSK          (~(((1U << SDH_PDFVSSM_LEN) - 1) << SDH_PDFVSSM_POS))
#define SDH_PDLVMC                SDH_PDLVMC
#define SDH_PDLVMC_POS            (14U)
#define SDH_PDLVMC_LEN            (1U)
#define SDH_PDLVMC_MSK            (((1U << SDH_PDLVMC_LEN) - 1) << SDH_PDLVMC_POS)
#define SDH_PDLVMC_UMSK           (~(((1U << SDH_PDLVMC_LEN) - 1) << SDH_PDLVMC_POS))
#define SDH_PRE_GATE_CLK_CNT      SDH_PRE_GATE_CLK_CNT
#define SDH_PRE_GATE_CLK_CNT_POS  (16U)
#define SDH_PRE_GATE_CLK_CNT_LEN  (4U)
#define SDH_PRE_GATE_CLK_CNT_MSK  (((1U << SDH_PRE_GATE_CLK_CNT_LEN) - 1) << SDH_PRE_GATE_CLK_CNT_POS)
#define SDH_PRE_GATE_CLK_CNT_UMSK (~(((1U << SDH_PRE_GATE_CLK_CNT_LEN) - 1) << SDH_PRE_GATE_CLK_CNT_POS))

/* 0x108 : SPI Mode Register */
#define SDH_SD_SPI_MODE_OFFSET (0x108)
#define SDH_SPI_EN             SDH_SPI_EN
#define SDH_SPI_EN_POS         (0U)
#define SDH_SPI_EN_LEN         (1U)
#define SDH_SPI_EN_MSK         (((1U << SDH_SPI_EN_LEN) - 1) << SDH_SPI_EN_POS)
#define SDH_SPI_EN_UMSK        (~(((1U << SDH_SPI_EN_LEN) - 1) << SDH_SPI_EN_POS))
#define SDH_SPI_ERR_TOKEN      SDH_SPI_ERR_TOKEN
#define SDH_SPI_ERR_TOKEN_POS  (8U)
#define SDH_SPI_ERR_TOKEN_LEN  (5U)
#define SDH_SPI_ERR_TOKEN_MSK  (((1U << SDH_SPI_ERR_TOKEN_LEN) - 1) << SDH_SPI_ERR_TOKEN_POS)
#define SDH_SPI_ERR_TOKEN_UMSK (~(((1U << SDH_SPI_ERR_TOKEN_LEN) - 1) << SDH_SPI_ERR_TOKEN_POS))

/* 0x10a : Clock and Burst Size Setup Register */
#define SDH_SD_CLOCK_AND_BURST_SIZE_SETUP_OFFSET (0x10a)
#define SDH_BRST_SIZE                            SDH_BRST_SIZE
#define SDH_BRST_SIZE_POS                        (0U)
#define SDH_BRST_SIZE_LEN                        (2U)
#define SDH_BRST_SIZE_MSK                        (((1U << SDH_BRST_SIZE_LEN) - 1) << SDH_BRST_SIZE_POS)
#define SDH_BRST_SIZE_UMSK                       (~(((1U << SDH_BRST_SIZE_LEN) - 1) << SDH_BRST_SIZE_POS))
#define SDH_DMA_SIZE                             SDH_DMA_SIZE
#define SDH_DMA_SIZE_POS                         (2U)
#define SDH_DMA_SIZE_LEN                         (2U)
#define SDH_DMA_SIZE_MSK                         (((1U << SDH_DMA_SIZE_LEN) - 1) << SDH_DMA_SIZE_POS)
#define SDH_DMA_SIZE_UMSK                        (~(((1U << SDH_DMA_SIZE_LEN) - 1) << SDH_DMA_SIZE_POS))
#define SDH_PRIORITY                             SDH_PRIORITY
#define SDH_PRIORITY_POS                         (4U)
#define SDH_PRIORITY_LEN                         (1U)
#define SDH_PRIORITY_MSK                         (((1U << SDH_PRIORITY_LEN) - 1) << SDH_PRIORITY_POS)
#define SDH_PRIORITY_UMSK                        (~(((1U << SDH_PRIORITY_LEN) - 1) << SDH_PRIORITY_POS))
#define SDH_AXI_NON_POST_WR                      SDH_AXI_NON_POST_WR
#define SDH_AXI_NON_POST_WR_POS                  (5U)
#define SDH_AXI_NON_POST_WR_LEN                  (1U)
#define SDH_AXI_NON_POST_WR_MSK                  (((1U << SDH_AXI_NON_POST_WR_LEN) - 1) << SDH_AXI_NON_POST_WR_POS)
#define SDH_AXI_NON_POST_WR_UMSK                 (~(((1U << SDH_AXI_NON_POST_WR_LEN) - 1) << SDH_AXI_NON_POST_WR_POS))
#define SDH_RD_ENDIAN                            SDH_RD_ENDIAN
#define SDH_RD_ENDIAN_POS                        (6U)
#define SDH_RD_ENDIAN_LEN                        (1U)
#define SDH_RD_ENDIAN_MSK                        (((1U << SDH_RD_ENDIAN_LEN) - 1) << SDH_RD_ENDIAN_POS)
#define SDH_RD_ENDIAN_UMSK                       (~(((1U << SDH_RD_ENDIAN_LEN) - 1) << SDH_RD_ENDIAN_POS))
#define SDH_WR_ENDIAN                            SDH_WR_ENDIAN
#define SDH_WR_ENDIAN_POS                        (7U)
#define SDH_WR_ENDIAN_LEN                        (1U)
#define SDH_WR_ENDIAN_MSK                        (((1U << SDH_WR_ENDIAN_LEN) - 1) << SDH_WR_ENDIAN_POS)
#define SDH_WR_ENDIAN_UMSK                       (~(((1U << SDH_WR_ENDIAN_LEN) - 1) << SDH_WR_ENDIAN_POS))
#define SDH_RD_OSTDG                             SDH_RD_OSTDG
#define SDH_RD_OSTDG_POS                         (14U)
#define SDH_RD_OSTDG_LEN                         (1U)
#define SDH_RD_OSTDG_MSK                         (((1U << SDH_RD_OSTDG_LEN) - 1) << SDH_RD_OSTDG_POS)
#define SDH_RD_OSTDG_UMSK                        (~(((1U << SDH_RD_OSTDG_LEN) - 1) << SDH_RD_OSTDG_POS))
#define SDH_WR_OSTDG                             SDH_WR_OSTDG
#define SDH_WR_OSTDG_POS                         (15U)
#define SDH_WR_OSTDG_LEN                         (1U)
#define SDH_WR_OSTDG_MSK                         (((1U << SDH_WR_OSTDG_LEN) - 1) << SDH_WR_OSTDG_POS)
#define SDH_WR_OSTDG_UMSK                        (~(((1U << SDH_WR_OSTDG_LEN) - 1) << SDH_WR_OSTDG_POS))

/* 0x10c : CE-ATA Register 1 */
#define SDH_SD_CE_ATA_1_OFFSET (0x10c)
#define SDH_CPL_TIMEOUT        SDH_CPL_TIMEOUT
#define SDH_CPL_TIMEOUT_POS    (0U)
#define SDH_CPL_TIMEOUT_LEN    (14U)
#define SDH_CPL_TIMEOUT_MSK    (((1U << SDH_CPL_TIMEOUT_LEN) - 1) << SDH_CPL_TIMEOUT_POS)
#define SDH_CPL_TIMEOUT_UMSK   (~(((1U << SDH_CPL_TIMEOUT_LEN) - 1) << SDH_CPL_TIMEOUT_POS))

/* 0x10e : CE-ATA Register 2 */
#define SDH_SD_CE_ATA_2_OFFSET       (0x10e)
#define SDH_MISC_INT_INT_EN          SDH_MISC_INT_INT_EN
#define SDH_MISC_INT_INT_EN_POS      (0U)
#define SDH_MISC_INT_INT_EN_LEN      (1U)
#define SDH_MISC_INT_INT_EN_MSK      (((1U << SDH_MISC_INT_INT_EN_LEN) - 1) << SDH_MISC_INT_INT_EN_POS)
#define SDH_MISC_INT_INT_EN_UMSK     (~(((1U << SDH_MISC_INT_INT_EN_LEN) - 1) << SDH_MISC_INT_INT_EN_POS))
#define SDH_MISC_INT_EN              SDH_MISC_INT_EN
#define SDH_MISC_INT_EN_POS          (1U)
#define SDH_MISC_INT_EN_LEN          (1U)
#define SDH_MISC_INT_EN_MSK          (((1U << SDH_MISC_INT_EN_LEN) - 1) << SDH_MISC_INT_EN_POS)
#define SDH_MISC_INT_EN_UMSK         (~(((1U << SDH_MISC_INT_EN_LEN) - 1) << SDH_MISC_INT_EN_POS))
#define SDH_MISC_INT                 SDH_MISC_INT
#define SDH_MISC_INT_POS             (2U)
#define SDH_MISC_INT_LEN             (1U)
#define SDH_MISC_INT_MSK             (((1U << SDH_MISC_INT_LEN) - 1) << SDH_MISC_INT_POS)
#define SDH_MISC_INT_UMSK            (~(((1U << SDH_MISC_INT_LEN) - 1) << SDH_MISC_INT_POS))
#define SDH_CPL_COMPLETE_INT_EN      SDH_CPL_COMPLETE_INT_EN
#define SDH_CPL_COMPLETE_INT_EN_POS  (4U)
#define SDH_CPL_COMPLETE_INT_EN_LEN  (1U)
#define SDH_CPL_COMPLETE_INT_EN_MSK  (((1U << SDH_CPL_COMPLETE_INT_EN_LEN) - 1) << SDH_CPL_COMPLETE_INT_EN_POS)
#define SDH_CPL_COMPLETE_INT_EN_UMSK (~(((1U << SDH_CPL_COMPLETE_INT_EN_LEN) - 1) << SDH_CPL_COMPLETE_INT_EN_POS))
#define SDH_CPL_COMPLETE_EN          SDH_CPL_COMPLETE_EN
#define SDH_CPL_COMPLETE_EN_POS      (5U)
#define SDH_CPL_COMPLETE_EN_LEN      (1U)
#define SDH_CPL_COMPLETE_EN_MSK      (((1U << SDH_CPL_COMPLETE_EN_LEN) - 1) << SDH_CPL_COMPLETE_EN_POS)
#define SDH_CPL_COMPLETE_EN_UMSK     (~(((1U << SDH_CPL_COMPLETE_EN_LEN) - 1) << SDH_CPL_COMPLETE_EN_POS))
#define SDH_CPL_COMPLETE             SDH_CPL_COMPLETE
#define SDH_CPL_COMPLETE_POS         (6U)
#define SDH_CPL_COMPLETE_LEN         (1U)
#define SDH_CPL_COMPLETE_MSK         (((1U << SDH_CPL_COMPLETE_LEN) - 1) << SDH_CPL_COMPLETE_POS)
#define SDH_CPL_COMPLETE_UMSK        (~(((1U << SDH_CPL_COMPLETE_LEN) - 1) << SDH_CPL_COMPLETE_POS))
#define SDH_MMC_RESETN               SDH_MMC_RESETN
#define SDH_MMC_RESETN_POS           (11U)
#define SDH_MMC_RESETN_LEN           (1U)
#define SDH_MMC_RESETN_MSK           (((1U << SDH_MMC_RESETN_LEN) - 1) << SDH_MMC_RESETN_POS)
#define SDH_MMC_RESETN_UMSK          (~(((1U << SDH_MMC_RESETN_LEN) - 1) << SDH_MMC_RESETN_POS))
#define SDH_MMC_CARD                 SDH_MMC_CARD
#define SDH_MMC_CARD_POS             (12U)
#define SDH_MMC_CARD_LEN             (1U)
#define SDH_MMC_CARD_MSK             (((1U << SDH_MMC_CARD_LEN) - 1) << SDH_MMC_CARD_POS)
#define SDH_MMC_CARD_UMSK            (~(((1U << SDH_MMC_CARD_LEN) - 1) << SDH_MMC_CARD_POS))
#define SDH_CEATA_CARD               SDH_CEATA_CARD
#define SDH_CEATA_CARD_POS           (13U)
#define SDH_CEATA_CARD_LEN           (1U)
#define SDH_CEATA_CARD_MSK           (((1U << SDH_CEATA_CARD_LEN) - 1) << SDH_CEATA_CARD_POS)
#define SDH_CEATA_CARD_UMSK          (~(((1U << SDH_CEATA_CARD_LEN) - 1) << SDH_CEATA_CARD_POS))
#define SDH_SND_CPL                  SDH_SND_CPL
#define SDH_SND_CPL_POS              (14U)
#define SDH_SND_CPL_LEN              (1U)
#define SDH_SND_CPL_MSK              (((1U << SDH_SND_CPL_LEN) - 1) << SDH_SND_CPL_POS)
#define SDH_SND_CPL_UMSK             (~(((1U << SDH_SND_CPL_LEN) - 1) << SDH_SND_CPL_POS))
#define SDH_CHK_CPL                  SDH_CHK_CPL
#define SDH_CHK_CPL_POS              (15U)
#define SDH_CHK_CPL_LEN              (1U)
#define SDH_CHK_CPL_MSK              (((1U << SDH_CHK_CPL_LEN) - 1) << SDH_CHK_CPL_POS)
#define SDH_CHK_CPL_UMSK             (~(((1U << SDH_CHK_CPL_LEN) - 1) << SDH_CHK_CPL_POS))

