RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/sdh_reg.h
/* 0x110 : PAD I/O Setup Register */
#define SDH_SD_PAD_IO_SETUP_OFFSET (0x110)
#define SDH_ASYNC_IO_EN            SDH_ASYNC_IO_EN
#define SDH_ASYNC_IO_EN_POS        (0U)
#define SDH_ASYNC_IO_EN_LEN        (1U)
#define SDH_ASYNC_IO_EN_MSK        (((1U << SDH_ASYNC_IO_EN_LEN) - 1) << SDH_ASYNC_IO_EN_POS)
#define SDH_ASYNC_IO_EN_UMSK       (~(((1U << SDH_ASYNC_IO_EN_LEN) - 1) << SDH_ASYNC_IO_EN_POS))
#define SDH_INAND_SEL              SDH_INAND_SEL
#define SDH_INAND_SEL_POS          (1U)
#define SDH_INAND_SEL_LEN          (1U)
#define SDH_INAND_SEL_MSK          (((1U << SDH_INAND_SEL_LEN) - 1) << SDH_INAND_SEL_POS)
#define SDH_INAND_SEL_UMSK         (~(((1U << SDH_INAND_SEL_LEN) - 1) << SDH_INAND_SEL_POS))
#define SDH_ECO_REG                SDH_ECO_REG
#define SDH_ECO_REG_POS            (16U)
#define SDH_ECO_REG_LEN            (8U)
#define SDH_ECO_REG_MSK            (((1U << SDH_ECO_REG_LEN) - 1) << SDH_ECO_REG_POS)
#define SDH_ECO_REG_UMSK           (~(((1U << SDH_ECO_REG_LEN) - 1) << SDH_ECO_REG_POS))

/* 0x114 : RX Configuration Register */
#define SDH_RX_CFG_REG_OFFSET   (0x114)
#define SDH_SDCLK_SEL0          SDH_SDCLK_SEL0
#define SDH_SDCLK_SEL0_POS      (0U)
#define SDH_SDCLK_SEL0_LEN      (2U)
#define SDH_SDCLK_SEL0_MSK      (((1U << SDH_SDCLK_SEL0_LEN) - 1) << SDH_SDCLK_SEL0_POS)
#define SDH_SDCLK_SEL0_UMSK     (~(((1U << SDH_SDCLK_SEL0_LEN) - 1) << SDH_SDCLK_SEL0_POS))
#define SDH_SDCLK_SEL1          SDH_SDCLK_SEL1
#define SDH_SDCLK_SEL1_POS      (2U)
#define SDH_SDCLK_SEL1_LEN      (2U)
#define SDH_SDCLK_SEL1_MSK      (((1U << SDH_SDCLK_SEL1_LEN) - 1) << SDH_SDCLK_SEL1_POS)
#define SDH_SDCLK_SEL1_UMSK     (~(((1U << SDH_SDCLK_SEL1_LEN) - 1) << SDH_SDCLK_SEL1_POS))
#define SDH_SDCLK_DELAY         SDH_SDCLK_DELAY
#define SDH_SDCLK_DELAY_POS     (8U)
#define SDH_SDCLK_DELAY_LEN     (10U)
#define SDH_SDCLK_DELAY_MSK     (((1U << SDH_SDCLK_DELAY_LEN) - 1) << SDH_SDCLK_DELAY_POS)
#define SDH_SDCLK_DELAY_UMSK    (~(((1U << SDH_SDCLK_DELAY_LEN) - 1) << SDH_SDCLK_DELAY_POS))
#define SDH_TUNING_DLY_INC      SDH_TUNING_DLY_INC
#define SDH_TUNING_DLY_INC_POS  (18U)
#define SDH_TUNING_DLY_INC_LEN  (10U)
#define SDH_TUNING_DLY_INC_MSK  (((1U << SDH_TUNING_DLY_INC_LEN) - 1) << SDH_TUNING_DLY_INC_POS)
#define SDH_TUNING_DLY_INC_UMSK (~(((1U << SDH_TUNING_DLY_INC_LEN) - 1) << SDH_TUNING_DLY_INC_POS))

/* 0x118 : TX Configuration Register */
#define SDH_TX_CFG_REG_OFFSET   (0x118)
#define SDH_TX_HOLD_DELAY0      SDH_TX_HOLD_DELAY0
#define SDH_TX_HOLD_DELAY0_POS  (0U)
#define SDH_TX_HOLD_DELAY0_LEN  (10U)
#define SDH_TX_HOLD_DELAY0_MSK  (((1U << SDH_TX_HOLD_DELAY0_LEN) - 1) << SDH_TX_HOLD_DELAY0_POS)
#define SDH_TX_HOLD_DELAY0_UMSK (~(((1U << SDH_TX_HOLD_DELAY0_LEN) - 1) << SDH_TX_HOLD_DELAY0_POS))
#define SDH_TX_HOLD_DELAY1      SDH_TX_HOLD_DELAY1
#define SDH_TX_HOLD_DELAY1_POS  (16U)
#define SDH_TX_HOLD_DELAY1_LEN  (10U)
#define SDH_TX_HOLD_DELAY1_MSK  (((1U << SDH_TX_HOLD_DELAY1_LEN) - 1) << SDH_TX_HOLD_DELAY1_POS)
#define SDH_TX_HOLD_DELAY1_UMSK (~(((1U << SDH_TX_HOLD_DELAY1_LEN) - 1) << SDH_TX_HOLD_DELAY1_POS))
#define SDH_TX_INT_CLK_SEL      SDH_TX_INT_CLK_SEL
#define SDH_TX_INT_CLK_SEL_POS  (30U)
#define SDH_TX_INT_CLK_SEL_LEN  (1U)
#define SDH_TX_INT_CLK_SEL_MSK  (((1U << SDH_TX_INT_CLK_SEL_LEN) - 1) << SDH_TX_INT_CLK_SEL_POS)
#define SDH_TX_INT_CLK_SEL_UMSK (~(((1U << SDH_TX_INT_CLK_SEL_LEN) - 1) << SDH_TX_INT_CLK_SEL_POS))
#define SDH_TX_MUX_SEL          SDH_TX_MUX_SEL
#define SDH_TX_MUX_SEL_POS      (31U)
#define SDH_TX_MUX_SEL_LEN      (1U)
#define SDH_TX_MUX_SEL_MSK      (((1U << SDH_TX_MUX_SEL_LEN) - 1) << SDH_TX_MUX_SEL_POS)
#define SDH_TX_MUX_SEL_UMSK     (~(((1U << SDH_TX_MUX_SEL_LEN) - 1) << SDH_TX_MUX_SEL_POS))

/* 0x11c : TUNING CONFIG Register */
#define SDH_TUNING_CFG_REG_OFFSET   (0x11c)
#define SDH_TUNING_TT_CNT           SDH_TUNING_TT_CNT
#define SDH_TUNING_TT_CNT_POS       (0U)
#define SDH_TUNING_TT_CNT_LEN       (8U)
#define SDH_TUNING_TT_CNT_MSK       (((1U << SDH_TUNING_TT_CNT_LEN) - 1) << SDH_TUNING_TT_CNT_POS)
#define SDH_TUNING_TT_CNT_UMSK      (~(((1U << SDH_TUNING_TT_CNT_LEN) - 1) << SDH_TUNING_TT_CNT_POS))
#define SDH_TUNING_WD_CNT           SDH_TUNING_WD_CNT
#define SDH_TUNING_WD_CNT_POS       (8U)
#define SDH_TUNING_WD_CNT_LEN       (6U)
#define SDH_TUNING_WD_CNT_MSK       (((1U << SDH_TUNING_WD_CNT_LEN) - 1) << SDH_TUNING_WD_CNT_POS)
#define SDH_TUNING_WD_CNT_UMSK      (~(((1U << SDH_TUNING_WD_CNT_LEN) - 1) << SDH_TUNING_WD_CNT_POS))
#define SDH_TUNING_CLK_DLY          SDH_TUNING_CLK_DLY
#define SDH_TUNING_CLK_DLY_POS      (14U)
#define SDH_TUNING_CLK_DLY_LEN      (10U)
#define SDH_TUNING_CLK_DLY_MSK      (((1U << SDH_TUNING_CLK_DLY_LEN) - 1) << SDH_TUNING_CLK_DLY_POS)
#define SDH_TUNING_CLK_DLY_UMSK     (~(((1U << SDH_TUNING_CLK_DLY_LEN) - 1) << SDH_TUNING_CLK_DLY_POS))
#define SDH_TUNING_SUCCESS_CNT      SDH_TUNING_SUCCESS_CNT
#define SDH_TUNING_SUCCESS_CNT_POS  (24U)
#define SDH_TUNING_SUCCESS_CNT_LEN  (6U)
#define SDH_TUNING_SUCCESS_CNT_MSK  (((1U << SDH_TUNING_SUCCESS_CNT_LEN) - 1) << SDH_TUNING_SUCCESS_CNT_POS)
#define SDH_TUNING_SUCCESS_CNT_UMSK (~(((1U << SDH_TUNING_SUCCESS_CNT_LEN) - 1) << SDH_TUNING_SUCCESS_CNT_POS))

struct sdh_reg {
    /* 0x00 : System Address Low Register */
    union {
        struct
        {
            uint16_t DMA_ADDR_L : 16; /* [15: 0],         RW,     0x0000 */
        } BF;
        uint16_t SHORT;
    } SD_SYS_ADDR_LOW;

    /* 0x02 : System Address High Register */
    union {
        struct
        {
            uint16_t DMA_ADDR_H : 16; /* [15: 0],         RW,     0x0000 */
        } BF;
        uint16_t SHORT;
    } SD_SYS_ADDR_HIGH;

    /* 0x04 : Block Size Register */
    union {
        struct
        {
            uint16_t BLOCK_SIZE    : 12; /* [11: 0],         RW,      0x000 */
            uint16_t HOST_DMA_BDRY : 3;  /* [14:12],         RW,        0x0 */
            uint16_t Reserved_15   : 1;  /* [   15],       RSVD,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_BLOCK_SIZE;

    /* 0x06 : Block Count Register */
    union {
        struct
        {
            uint16_t BLOCK_COUNT : 16; /* [15: 0],         RW,     0x0000 */
        } BF;
        uint16_t SHORT;
    } SD_BLOCK_COUNT;

    /* 0x08 : Argument Low Register */
    union {
        struct
        {
            uint16_t ARG_L : 16; /* [15: 0],        RW ,     0x0000 */
        } BF;
        uint16_t SHORT;
    } SD_ARG_LOW;

