RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/sdh_reg.h
    /* 0x0A : Argument High Register */
    union {
        struct
        {
            uint16_t ARG_H : 16; /* [15: 0],         RW,     0x0000 */
        } BF;
        uint16_t SHORT;
    } SD_ARG_HIGH;

    /* 0x0C : Transfer Mode Register */
    union {
        struct
        {
            uint16_t DMA_EN        : 1;  /* [    0],         RW,        0x0 */
            uint16_t BLK_CNT_EN    : 1;  /* [    1],         RW,        0x0 */
            uint16_t AUTO_CMD_EN   : 2;  /* [ 3: 2],         RW,        0x0 */
            uint16_t TO_HOST_DIR   : 1;  /* [    4],         RW,        0x0 */
            uint16_t MULTI_BLK_SEL : 1;  /* [    5],         RW,        0x0 */
            uint16_t Reserved_15_6 : 10; /* [15: 6],       RSVD,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_TRANSFER_MODE;

    /* 0x0E : Command Register */
    union {
        struct
        {
            uint16_t RESP_TYPE        : 2; /* [ 1: 0],         RW,        0x0 */
            uint16_t Reserved_2       : 1; /* [    2],       RSVD,        0x0 */
            uint16_t CMD_CRC_CHK_EN   : 1; /* [    3],         RW,        0x0 */
            uint16_t CMD_INDEX_CHK_EN : 1; /* [    4],         RW,        0x0 */
            uint16_t DATA_PRESENT     : 1; /* [    5],         RW,        0x0 */
            uint16_t CMD_TYPE         : 2; /* [ 7: 6],         RW,        0x0 */
            uint16_t CMD_INDEX        : 6; /* [13: 8],         RW,       0x00 */
            uint16_t Reserved_15_14   : 2; /* [15:14],       RSVD,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_CMD;

    /* 0x10 : Response Register 0 */
    union {
        struct
        {
            uint16_t RESP0 : 16; /* [15: 0],         RO,     0x0000 */
        } BF;
        uint16_t SHORT;
    } SD_RESP_0;

    /* 0x12 : Response Register 1 */
    union {
        struct
        {
            uint16_t RESP1 : 16; /* [15: 0],         RO,     0x0000 */
        } BF;
        uint16_t SHORT;
    } SD_RESP_1;

    /* 0x14 : Response Register 2 */
    union {
        struct
        {
            uint16_t RESP2 : 16; /* [15: 0],         RO,     0x0000 */
        } BF;
        uint16_t SHORT;
    } SD_RESP_2;

    /* 0x16 : Response Register 3 */
    union {
        struct
        {
            uint16_t RESP3 : 16; /* [15: 0],         RO,     0x0000 */
        } BF;
        uint16_t SHORT;
    } SD_RESP_3;

    /* 0x18 : Response Register 4 */
    union {
        struct
        {
            uint16_t RESP4 : 16; /* [15: 0],         RO,     0x0000 */
        } BF;
        uint16_t SHORT;
    } SD_RESP_4;

    /* 0x1A : Response Register 5 */
    union {
        struct
        {
            uint16_t RESP5 : 16; /* [15: 0],         RO,     0x0000 */
        } BF;
        uint16_t SHORT;
    } SD_RESP_5;

    /* 0x1C : Response Register 6 */
    union {
        struct
        {
            uint16_t RESP6 : 16; /* [15: 0],         RO,     0x0000 */
        } BF;
        uint16_t SHORT;
    } SD_RESP_6;

    /* 0x1E : Response Register 7 */
    union {
        struct
        {
            uint16_t RESP7 : 16; /* [15: 0],         RO,     0x0000 */
        } BF;
        uint16_t SHORT;
    } SD_RESP_7;

    /* 0x20 : Buffer Data Port 0 Register */
    union {
        struct
        {
            uint16_t CPU_DATA0 : 16; /* [15: 0],         RW,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_BUFFER_DATA_PORT_0;

    /* 0x22 : Buffer Data Port 1 Register */
    union {
        struct
        {
            uint16_t CPU_DATA1 : 16; /* [15: 0],         RW,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_BUFFER_DATA_PORT_1;

    /* 0x24 : Present State Register 1 */
    union {
        struct
        {
            uint16_t CMD_INHIBIT_CMD : 1; /* [    0],         RO,        0x0 */
            uint16_t CMD_INHIBIT_DAT : 1; /* [    1],         RO,        0x0 */
            uint16_t _DAT_ACTIVE     : 1; /* [    2],         RO,        0x0 */
            uint16_t RETUNING_REQ    : 1; /* [    3],         RO,        0x0 */
            uint16_t Reserved_7_4    : 4; /* [ 7: 4],       RSVD,        0x0 */
            uint16_t TX_ACTIVE       : 1; /* [    8],         RO,        0x0 */
            uint16_t RX_ACTIVE       : 1; /* [    9],         RO,        0x0 */
            uint16_t BUFFER_WR_EN    : 1; /* [   10],         RO,        0x1 */
            uint16_t BUFFER_RD_EN    : 1; /* [   11],         RO,        0x0 */
            uint16_t Reserved_15_12  : 4; /* [15:12],       RSVD,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_PRESENT_STATE_1;

    /* 0x26 : Present State Register 2 */
    union {
        struct
        {
            uint16_t CARD_INSERTED : 1; /* [    0],         RO,        0x0 */
            uint16_t CARD_STABLE   : 1; /* [    1],         RO,        0x0 */
            uint16_t CARD_DET      : 1; /* [    2],         RO,        0x0 */
            uint16_t WRITE_PROT    : 1; /* [    3],         RO,        0x0 */
            uint16_t DAT_LEVEL     : 4; /* [ 7: 4],         RO,        0xF */
            uint16_t CMD_LEVEL     : 1; /* [    8],         RO,        0x1 */
            uint16_t Reserved_15_9 : 7; /* [15: 9],       RSVD,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_PRESENT_STATE_2;

    /* 0x28 : Host Control Register */
    union {
        struct
        {
            uint16_t LED_CTRL       : 1; /* [    0],         RW,        0x0 */
            uint16_t DATA_WIDTH     : 1; /* [    1],         RW,        0x0 */
            uint16_t HI_SPEED_EN    : 1; /* [    2],         RW,        0x0 */
            uint16_t DMA_SEL        : 2; /* [ 4: 3],         RW,        0x0 */
            uint16_t EX_DATA_WIDTH  : 1; /* [    5],         RW,        0x0 */
            uint16_t CARD_DET_L     : 1; /* [    6],         RW,        0x0 */
            uint16_t CARD_DET_S     : 1; /* [    7],         RW,        0x0 */
            uint16_t SD_BUS_POWER   : 1; /* [    8],         RW,        0x0 */
            uint16_t SD_BUS_VLT     : 3; /* [11: 9],         RW,        0x0 */
            uint16_t Reserved_15_12 : 4; /* [15:12],       RSVD,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_HOST_CTRL;

    /* 0x2A : Block Gap Control Register */
    union {
        struct
        {
            uint16_t STOP_AT_BLOCK_GAP_REQ : 1; /* [    0],         RW,        0x0 */
            uint16_t CONT_REQ              : 1; /* [    1],       RWAC,        0x0 */
            uint16_t RD_WAIT_CTL           : 1; /* [    2],         RW,        0x0 */
            uint16_t INT_BLK_GAP           : 1; /* [    3],         RW,        0x0 */
            uint16_t Reserved_7_4          : 4; /* [ 7: 4],       RSVD,        0x0 */
            uint16_t W_CARD_INT            : 1; /* [    8],         RW,        0x0 */
            uint16_t W_INSERTION           : 1; /* [    9],         RW,        0x0 */
            uint16_t W_REMOVAL             : 1; /* [   10],         RW,        0x0 */
            uint16_t Reserved_15_11        : 5; /* [15:11],       RSVD,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_BLOCK_GAP_CTRL;

    /* 0x2C : Clock Control Register */
    union {
        struct
        {
            uint16_t INT_CLK_EN     : 1; /* [    0],         RW,        0x0 */
            uint16_t INT_CLK_STABLE : 1; /* [    1],         RO,        0x0 */
            uint16_t SD_CLK_EN      : 1; /* [    2],         RW,        0x0 */
            uint16_t Reserved_4_3   : 2; /* [ 4: 3],       RSVD,        0x0 */
            uint16_t CLK_GEN_SEL    : 1; /* [    5],         RW,        0x0 */
            uint16_t SD_FREQ_SEL_HI : 2; /* [ 7: 6],         RW,        0x0 */
            uint16_t SD_FREQ_SEL_LO : 8; /* [15: 8],         RW,       0x00 */
        } BF;
        uint16_t SHORT;
    } SD_CLOCK_CTRL;

    /* 0x2E : Timeout Control/Software Reset Register */
    union {
        struct
        {
            uint16_t TIMEOUT_VALUE  : 4; /* [ 3: 0],         RW,        0x0 */
            uint16_t Reserved_7_4   : 4; /* [ 7: 4],       RSVD,        0x0 */
            uint16_t SW_RST_ALL     : 1; /* [    8],       RWAC,        0x0 */
            uint16_t SW_RST_CMD     : 1; /* [    9],       RWAC,        0x0 */
            uint16_t SW_RST_DAT     : 1; /* [   10],       RWAC,        0x0 */
            uint16_t Reserved_15_11 : 5; /* [15:11],       RSVD,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_TIMEOUT_CTRL_SW_RESET;

    /* 0x30 : Normal Interrupt Status Register */
    union {
        struct
        {
            uint16_t CMD_COMPLETE   : 1; /* [    0],       RW1C,        0x0 */
            uint16_t XFER_COMPLETE  : 1; /* [    1],       RW1C,        0x0 */
            uint16_t BLOCK_GAP_EVT  : 1; /* [    2],       RW1C,        0x0 */
            uint16_t DMA_INT        : 1; /* [    3],       RW1C,        0x0 */
            uint16_t TX_RDY         : 1; /* [    4],       RW1C,        0x1 */
            uint16_t RX_RDY         : 1; /* [    5],       RW1C,        0x0 */
            uint16_t CARD_INS_INT   : 1; /* [    6],       RW1C,        0x0 */
            uint16_t CARD_REM_INT   : 1; /* [    7],       RW1C,        0x0 */
            uint16_t CARD_INT       : 1; /* [    8],         RO,        0x0 */
            uint16_t INT_A          : 1; /* [    9],       RW1C,        0x0 */
            uint16_t INT_B          : 1; /* [   10],       RW1C,        0x0 */
            uint16_t INT_C          : 1; /* [   11],       RW1C,        0x0 */
            uint16_t RETUNING_INT   : 1; /* [   12],       RW1C,        0x0 */
            uint16_t Reserved_14_13 : 2; /* [14:13],       RSVD,        0x0 */
            uint16_t ERR_INT        : 1; /* [   15],         RO,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_NORMAL_INT_STATUS;

    /* 0x32 : Error Interrupt Status Register */
    union {
        struct
        {
            uint16_t CMD_TIMEOUT_ERR     : 1; /* [    0],       RW1C,        0x0 */
            uint16_t CMD_CRC_ERR         : 1; /* [    1],       RW1C,        0x0 */
            uint16_t CMD_END_BIT_ERR     : 1; /* [    2],       RW1C,        0x0 */
            uint16_t CMD_INDEX_ERR       : 1; /* [    3],       RW1C,        0x0 */
            uint16_t DATA_TIMEOUT_ERR    : 1; /* [    4],       RW1C,        0x0 */
            uint16_t RD_DATA_CRC_ERR     : 1; /* [    5],       RW1C,        0x0 */
            uint16_t RD_DATA_END_BIT_ERR : 1; /* [    6],       RW1C,        0x0 */
            uint16_t CUR_LIMIT_ERR       : 1; /* [    7],       RW1C,        0x0 */
            uint16_t AUTO_CMD12_ERR      : 1; /* [    8],       RW1C,        0x0 */
            uint16_t ADMA_ERR            : 1; /* [    9],       RW1C,        0x0 */
            uint16_t TUNE_ERR            : 1; /* [   10],       RW1C,        0x0 */
            uint16_t Reserved_11         : 1; /* [   11],       RSVD,        0x0 */
            uint16_t SPI_ERR             : 1; /* [   12],       RW1C,        0x0 */
            uint16_t AXI_RESP_ERR        : 1; /* [   13],       RW1C,        0x0 */
            uint16_t CPL_TIMEOUT_ERR     : 1; /* [   14],       RW1C,        0x0 */
            uint16_t CRC_STATUS_ERR      : 1; /* [   15],       RW1C,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_ERROR_INT_STATUS;

    /* 0x34 : Normal Interrupt Status Enable Register */
    union {
        struct
        {
            uint16_t CMD_COMPLETE_EN  : 1; /* [    0],         RW,        0x0 */
            uint16_t XFER_COMPLETE_EN : 1; /* [    1],         RW,        0x0 */
            uint16_t BLOCK_GAP_EVT_EN : 1; /* [    2],         RW,        0x0 */
            uint16_t DMA_INT_EN       : 1; /* [    3],         RW,        0x0 */
            uint16_t TX_RDY_EN        : 1; /* [    4],         RW,        0x0 */
            uint16_t RD_RDY_EN        : 1; /* [    5],         RW,        0x0 */
            uint16_t CARD_INS_EN      : 1; /* [    6],         RW,        0x0 */
            uint16_t CARD_REM_EN      : 1; /* [    7],         RW,        0x0 */
            uint16_t CARD_INT_EN      : 1; /* [    8],         RW,        0x0 */
            uint16_t INT_A_INT_EN     : 1; /* [    9],         RW,        0x0 */
            uint16_t INT_B_INT_EN     : 1; /* [   10],         RW,        0x0 */
            uint16_t INT_C_INT_EN     : 1; /* [   11],         RW,        0x0 */
            uint16_t RETUNE_INT_EN    : 1; /* [   12],         RW,        0x0 */
            uint16_t Reserved_15_13   : 3; /* [15:13],       RSVD,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_NORMAL_INT_STATUS_EN;

    /* 0x36 : Error Interrupt Status Enable Register */
    union {
        struct
        {
            uint16_t CMD_TIMEOUT_ERR_EN     : 1; /* [    0],         RW,        0x0 */
            uint16_t CMD_CRC_ERR_EN         : 1; /* [    1],         RW,        0x0 */
            uint16_t CMD_END_BIT_ERR_EN     : 1; /* [    2],         RW,        0x0 */
            uint16_t CMD_INDEX_ERR_EN       : 1; /* [    3],         RW,        0x0 */
            uint16_t DATA_TIMEOUT_ERR_EN    : 1; /* [    4],         RW,        0x0 */
            uint16_t RD_DATA_CRC_ERR_EN     : 1; /* [    5],         RW,        0x0 */
            uint16_t RD_DATA_END_BIT_ERR_EN : 1; /* [    6],         RW,        0x0 */
            uint16_t CUR_LIM_ERR_EN         : 1; /* [    7],         RW,        0x0 */
            uint16_t AUTO_CMD12_ERR_EN      : 1; /* [    8],         RW,        0x0 */
            uint16_t ADMA_ERR_EN            : 1; /* [    9],         RW,        0x0 */
            uint16_t TUNING_ERR_EN          : 1; /* [   10],         RW,        0x0 */
            uint16_t Reserved_11            : 1; /* [   11],       RSVD,        0x0 */
            uint16_t SPI_ERR_EN             : 1; /* [   12],         RW,        0x0 */
            uint16_t AXI_RESP_ERR_EN        : 1; /* [   13],         RW,        0x0 */
            uint16_t CPL_TIMEOUT_ERR_EN     : 1; /* [   14],         RW,        0x0 */
            uint16_t CRC_STATUS_ERR_EN      : 1; /* [   15],         RW,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_ERROR_INT_STATUS_EN;

