RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/sdh_reg.h
    /* 0x38 : Normal Interrupt Status Interrupt Enable Register */
    union {
        struct
        {
            uint16_t CMD_COMPLETE_INT_EN  : 1; /* [    0],         RW,        0x0 */
            uint16_t XFER_COMPLETE_INT_EN : 1; /* [    1],         RW,        0x0 */
            uint16_t BLOCK_GAP_EVT_INT_EN : 1; /* [    2],         RW,        0x0 */
            uint16_t DMA_INT_INT_EN       : 1; /* [    3],         RW,        0x0 */
            uint16_t TX_RDY_INT_EN        : 1; /* [    4],         RW,        0x0 */
            uint16_t RX_RDY_INT_EN        : 1; /* [    5],         RW,        0x0 */
            uint16_t CARD_INS_INT_EN      : 1; /* [    6],         RW,        0x0 */
            uint16_t CARD_REM_INT_EN      : 1; /* [    7],         RW,        0x0 */
            uint16_t CARD_INT_INT_EN      : 1; /* [    8],         RW,        0x0 */
            uint16_t INT_A_INT_INT_EN     : 1; /* [    9],         RW,        0x0 */
            uint16_t INT_B_INT_INT_EN     : 1; /* [   10],         RW,        0x0 */
            uint16_t INT_C_INT_INT_EN     : 1; /* [   11],         RW,        0x0 */
            uint16_t RETUNE_INT_INT_EN    : 1; /* [   12],         RW,        0x0 */
            uint16_t Reserved_15_13       : 3; /* [15:13],       RSVD,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_NORMAL_INT_STATUS_INT_EN;

    /* 0x3A : Error Interrupt Status Interrupt Enable Register */
    union {
        struct
        {
            uint16_t CMD_TIMEOUT_ERR_INT_EN     : 1; /* [    0],         RW,        0x0 */
            uint16_t CMD_CRC_ERR_INT_EN         : 1; /* [    1],         RW,        0x0 */
            uint16_t CMD_END_BIT_ERR_INT_EN     : 1; /* [    2],         RW,        0x0 */
            uint16_t CMD_INDEX_ERR_INT_EN       : 1; /* [    3],         RW,        0x0 */
            uint16_t DATA_TIMEOUT_ERR_INT_EN    : 1; /* [    4],         RW,        0x0 */
            uint16_t RD_DATA_CRC_ERR_INT_EN     : 1; /* [    5],         RW,        0x0 */
            uint16_t RD_DATA_END_BIT_ERR_INT_EN : 1; /* [    6],         RW,        0x0 */
            uint16_t CUR_LIM_ERR_INT_EN         : 1; /* [    7],         RW,        0x0 */
            uint16_t AUTO_CMD12_ERR_INT_EN      : 1; /* [    8],         RW,        0x0 */
            uint16_t ADMA_ERR_INT_EN            : 1; /* [    9],         RW,        0x0 */
            uint16_t TUNE_ERR_INT_EN            : 1; /* [   10],         RW,        0x0 */
            uint16_t Reserved_11                : 1; /* [   11],       RSVD,        0x0 */
            uint16_t SPI_ERR_INT_EN             : 1; /* [   12],         RW,        0x0 */
            uint16_t AXI_RESP_ERR_INT_EN        : 1; /* [   13],         RW,        0x0 */
            uint16_t CPL_TIMEOUT_ERR_INT_EN     : 1; /* [   14],         RW,        0x0 */
            uint16_t CRC_STATUS_ERR_INT_EN      : 1; /* [   15],         RW,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_ERROR_INT_STATUS_INT_EN;

    /* 0x3C : Auto CMD12 Error Status Register */
    union {
        struct
        {
            uint16_t AUTO_CMD12_NOT_EXE   : 1; /* [    0],       RW1C,        0x0 */
            uint16_t AUTO_CMD_TIMEOUT_ERR : 1; /* [    1],       RW1C,        0x0 */
            uint16_t AUTO_CMD_CRC_ERR     : 1; /* [    2],       RW1C,        0x0 */
            uint16_t AUTO_CMD_END_BIT_ERR : 1; /* [    3],       RW1C,        0x0 */
            uint16_t AUTO_CMD_INDEX_ERR   : 1; /* [    4],       RW1C,        0x0 */
            uint16_t Reserved_6_5         : 2; /* [ 6: 5],       RSVD,        0x0 */
            uint16_t CMD_NOT_ISSUED       : 1; /* [    7],        ROC,        0x0 */
            uint16_t Reserved_15_8        : 8; /* [15: 8],       RSVD,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_AUTO_CMD12_ERROR_STATUS;

    /* 0x3e : Host Control 2 Register */
    union {
        struct
        {
            uint16_t UHS_MODE_SEL     : 3; /* [ 2: 0],         RW,        0x0 */
            uint16_t SDH_V18_EN       : 1; /* [    3],         RW,        0x0 */
            uint16_t DRV_STRENGTH_SEL : 2; /* [ 5: 4],         RW,        0x0 */
            uint16_t EXE_TUNING       : 1; /* [    6],       RWAC,        0x0 */
            uint16_t SAMPLING_CLK_SEL : 1; /* [    7],         RW,        0x0 */
            uint16_t Reserved_13_8    : 6; /* [13: 8],       RSVD,        0x0 */
            uint16_t ASYNC_INT_EN     : 1; /* [   14],         RW,        0x1 */
            uint16_t PRE_VAL_EN       : 1; /* [   15],         RW,        0x0 */
        } BF;
        uint16_t SHORT;
    } HOST_CTRL_2;

    /* 0x40 : Capabilities Register 1 */
    union {
        struct
        {
            uint16_t TIMEOUT_FREQ : 6; /* [ 5: 0],         RO,       0x00 */
            uint16_t Reserved_6   : 1; /* [    6],       RSVD,        0x0 */
            uint16_t TIMEOUT_UNIT : 1; /* [    7],         RO,        0x1 */
            uint16_t BASE_FREQ    : 8; /* [15: 8],         RO,       0x00 */
        } BF;
        uint16_t SHORT;
    } SD_CAPABILITIES_1;

    /* 0x42 : Capabilities Register 2 */
    union {
        struct
        {
            uint16_t MAX_BLK_LEN           : 2; /* [ 1: 0],         RO,        0x0 */
            uint16_t EX_DATA_WIDTH_SUPPORT : 1; /* [    2],         RO,        0x1 */
            uint16_t ADMA2_SUPPORT         : 1; /* [    3],         RO,        0x1 */
            uint16_t ADMA1_SUPPORT         : 1; /* [    4],         RO,        0x1 */
            uint16_t HI_SPEED_SUPPORT      : 1; /* [    5],         RO,        0x1 */
            uint16_t SDMA_SUPPORT          : 1; /* [    6],         RO,        0x1 */
            uint16_t SUS_RES_SUPPORT       : 1; /* [    7],         RO,        0x1 */
            uint16_t VLG_33_SUPPORT        : 1; /* [    8],         RO,        0x1 */
            uint16_t VLG_30_SUPPORT        : 1; /* [    9],         RO,        0x0 */
            uint16_t VLG_18_SUPPORT        : 1; /* [   10],         RO,        0x1 */
            uint16_t Reserved_11           : 1; /* [   11],       RSVD,        0x0 */
            uint16_t SYS_BUS_64_SUPPORT    : 1; /* [   12],         RO,        0x0 */
            uint16_t ASYNC_INT_SUPPORT     : 1; /* [   13],         RO,        0x1 */
            uint16_t CFG_SLOT_TYPE         : 2; /* [15:14],         RW,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_CAPABILITIES_2;

    /* 0x44 : Capabilities Register 3 */
    union {
        struct
        {
            uint16_t SDR50_SUPPORT  : 1; /* [    0],         RO,        0x1 */
            uint16_t SDR104_SUPPORT : 1; /* [    1],         RO,        0x1 */
            uint16_t DDR50_SUPPORT  : 1; /* [    2],         RO,        0x1 */
            uint16_t Reserved_3     : 1; /* [    3],       RSVD,        0x0 */
            uint16_t DRV_TYPE_A     : 1; /* [    4],         RO,        0x1 */
            uint16_t DRV_TYPE_C     : 1; /* [    5],         RO,        0x1 */
            uint16_t DRV_TYPE_D     : 1; /* [    6],         RO,        0x1 */
            uint16_t Reserved_7     : 1; /* [    7],       RSVD,        0x0 */
            uint16_t TMR_RETUNE     : 4; /* [11: 8],         RO,        0xf */
            uint16_t Reserved_12    : 1; /* [   12],       RSVD,        0x0 */
            uint16_t SDR50_TUNE     : 1; /* [   13],         RO,        0x1 */
            uint16_t RETUNE_MODES   : 2; /* [15:14],         RO,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_CAPABILITIES_3;

