RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/sdh_reg.h
    /* 0x104 : FIFO Parameters Register */
    union {
        struct
        {
            uint32_t RTC              : 2;  /* [ 1: 0],         RW,        0x1 */
            uint32_t WTC              : 2;  /* [ 3: 2],         RW,        0x1 */
            uint32_t FIFO_CLK         : 1;  /* [    4],         RW,        0x0 */
            uint32_t FIFO_CS          : 1;  /* [    5],         RW,        0x0 */
            uint32_t PDWN             : 1;  /* [    6],         RW,        0x0 */
            uint32_t use_dat3         : 1;  /* [    7],         RW,        0x0 */
            uint32_t CLK_GATE_CTL     : 1;  /* [    8],         RW,        0x0 */
            uint32_t CLK_GATE_ON      : 1;  /* [    9],         RW,        0x0 */
            uint32_t Reserved_10      : 1;  /* [   10],       RSVD,        0x0 */
            uint32_t OVRRD_CLK_OEN    : 1;  /* [   11],         RW,        0x0 */
            uint32_t FORCE_CLK_ON     : 1;  /* [   12],         RW,        0x0 */
            uint32_t PDFVSSM          : 1;  /* [   13],         RW,        0x0 */
            uint32_t PDLVMC           : 1;  /* [   14],         RW,        0x0 */
            uint32_t Reserved_15      : 1;  /* [   15],       RSVD,        0x0 */
            uint32_t PRE_GATE_CLK_CNT : 4;  /* [19:16],         RW,        0x7 */
            uint32_t Reserved_31_20   : 12; /* [31:20],       RSVD,        0x0 */
        } BF;
        uint32_t WORD;
    } SD_FIFO_PARAM;

    /* 0x108 : SPI Mode Register */
    union {
        struct
        {
            uint16_t SPI_EN         : 1; /* [    0],         RW,        0x0 */
            uint16_t Reserved_7_1   : 7; /* [ 7: 1],       RSVD,        0x0 */
            uint16_t SPI_ERR_TOKEN  : 5; /* [12: 8],         RW,        0x0 */
            uint16_t Reserved_15_13 : 3; /* [15:13],       RSVD,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_SPI_MODE;

    /* 0x10a : Clock and Burst Size Setup Register */
    union {
        struct
        {
            uint16_t BRST_SIZE       : 2; /* [ 1: 0],         RW,        0x2 */
            uint16_t DMA_SIZE        : 2; /* [ 3: 2],         RW,        0x3 */
            uint16_t priority        : 1; /* [    4],         RW,        0x0 */
            uint16_t AXI_NON_POST_WR : 1; /* [    5],         RW,        0x0 */
            uint16_t RD_ENDIAN       : 1; /* [    6],         RW,        0x1 */
            uint16_t WR_ENDIAN       : 1; /* [    7],         RW,        0x1 */
            uint16_t Reserved_13_8   : 6; /* [13: 8],       RSVD,        0x0 */
            uint16_t RD_OSTDG        : 1; /* [   14],         RW,        0x0 */
            uint16_t WR_OSTDG        : 1; /* [   15],         RW,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_CLOCK_AND_BURST_SIZE_SETUP;

    /* 0x10c : CE-ATA Register 1 */
    union {
        struct
        {
            uint16_t CPL_TIMEOUT    : 14; /* [13: 0],         RW,     0x3FFF */
            uint16_t Reserved_15_14 : 2;  /* [15:14],       RSVD,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_CE_ATA_1;

    /* 0x10e : CE-ATA Register 2 */
    union {
        struct
        {
            uint16_t MISC_INT_INT_EN     : 1; /* [    0],         RW,        0x0 */
            uint16_t MISC_INT_EN         : 1; /* [    1],         RW,        0x0 */
            uint16_t MISC_INT            : 1; /* [    2],       RW1C,        0x0 */
            uint16_t Reserved_3          : 1; /* [    3],       RSVD,        0x0 */
            uint16_t CPL_COMPLETE_INT_EN : 1; /* [    4],         RW,        0x0 */
            uint16_t CPL_COMPLETE_EN     : 1; /* [    5],         RW,        0x0 */
            uint16_t CPL_COMPLETE        : 1; /* [    6],       RW1C,        0x0 */
            uint16_t Reserved_10_7       : 4; /* [10: 7],       RSVD,        0x0 */
            uint16_t MMC_RESETN          : 1; /* [   11],         RW,        0x1 */
            uint16_t MMC_CARD            : 1; /* [   12],         RW,        0x0 */
            uint16_t CEATA_CARD          : 1; /* [   13],         RW,        0x0 */
            uint16_t SND_CPL             : 1; /* [   14],         RW,        0x0 */
            uint16_t CHK_CPL             : 1; /* [   15],         RW,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_CE_ATA_2;

    /* 0x110 : PAD I/O Setup Register */
    union {
        struct
        {
            uint32_t ASYNC_IO_EN    : 1;  /* [    0],         RW,        0x0 */
            uint32_t INAND_SEL      : 1;  /* [    1],         RW,        0x1 */
            uint32_t Reserved_15_2  : 14; /* [15: 2],       RSVD,        0x0 */
            uint32_t ECO_REG        : 8;  /* [23:16],         RW,        0x0 */
            uint32_t Reserved_31_24 : 8;  /* [31:24],       RSVD,        0x0 */
        } BF;
        uint32_t WORD;
    } SD_PAD_IO_SETUP;

    /* 0x114 : RX Configuration Register */
    union {
        struct
        {
            uint32_t SDCLK_SEL0     : 2;  /* [ 1: 0],         RW,        0x0 */
            uint32_t SDCLK_SEL1     : 2;  /* [ 3: 2],         RW,        0x0 */
            uint32_t Reserved_7_4   : 4;  /* [ 7: 4],       RSVD,        0x0 */
            uint32_t SDCLK_DELAY    : 10; /* [17: 8],         RW,        0x0 */
            uint32_t TUNING_DLY_INC : 10; /* [27:18],         RW,        0x0 */
            uint32_t Reserved_31_28 : 4;  /* [31:28],       RSVD,        0x0 */
        } BF;
        uint32_t WORD;
    } RX_CFG_REG;

    /* 0x118 : TX Configuration Register */
    union {
        struct
        {
            uint32_t TX_HOLD_DELAY0 : 10; /* [ 9: 0],         RW,       0x70 */
            uint32_t Reserved_15_10 : 6;  /* [15:10],       RSVD,        0x0 */
            uint32_t TX_HOLD_DELAY1 : 10; /* [25:16],         RW,       0x29 */
            uint32_t Reserved_29_26 : 4;  /* [29:26],       RSVD,        0x0 */
            uint32_t TX_INT_CLK_SEL : 1;  /* [   30],         RW,        0x0 */
            uint32_t TX_MUX_SEL     : 1;  /* [   31],         RW,        0x0 */
        } BF;
        uint32_t WORD;
    } TX_CFG_REG;

    /* 0x11c : TUNING CONFIG Register */
    union {
        struct
        {
            uint32_t TUNING_TT_CNT  : 8;  /* [ 7: 0],         RW,       0x27 */
            uint32_t TUNING_WD_CNT  : 6;  /* [13: 8],         RW,       0x0a */
            uint32_t TUNING_CLK_DLY : 10; /* [23:14],         RO,        0x0 */
            uint32_t
                TUNING_SUCCESS_CNT  : 6; /* [29:24],         RO,        0x0 */
            uint32_t Reserved_31_30 : 2; /* [31:30],       RSVD,        0x0 */
        } BF;
        uint32_t WORD;
    } TUNING_CFG_REG;
};

typedef volatile struct sdh_reg sdh_reg_t;

#endif /* __SDH_REG_H__ */
